/* automatically generated by rust-bindgen 0.69.4 */

#[repr(C)]
#[derive(Copy, Clone, Debug, Default, Eq, Hash, Ord, PartialEq, PartialOrd)]
pub struct __BindgenBitfieldUnit<Storage> {
    storage: Storage,
}
impl<Storage> __BindgenBitfieldUnit<Storage> {
    #[inline]
    pub const fn new(storage: Storage) -> Self {
        Self { storage }
    }
}
impl<Storage> __BindgenBitfieldUnit<Storage>
where
    Storage: AsRef<[u8]> + AsMut<[u8]>,
{
    #[inline]
    pub fn get_bit(&self, index: usize) -> bool {
        debug_assert!(index / 8 < self.storage.as_ref().len());
        let byte_index = index / 8;
        let byte = self.storage.as_ref()[byte_index];
        let bit_index = if cfg!(target_endian = "big") {
            7 - (index % 8)
        } else {
            index % 8
        };
        let mask = 1 << bit_index;
        byte & mask == mask
    }
    #[inline]
    pub fn set_bit(&mut self, index: usize, val: bool) {
        debug_assert!(index / 8 < self.storage.as_ref().len());
        let byte_index = index / 8;
        let byte = &mut self.storage.as_mut()[byte_index];
        let bit_index = if cfg!(target_endian = "big") {
            7 - (index % 8)
        } else {
            index % 8
        };
        let mask = 1 << bit_index;
        if val {
            *byte |= mask;
        } else {
            *byte &= !mask;
        }
    }
    #[inline]
    pub fn get(&self, bit_offset: usize, bit_width: u8) -> u64 {
        debug_assert!(bit_width <= 64);

pub const TABLE_AVFS: u32 = 2;
pub const TABLE_AVFS_PSM_DEBUG: u32 = 3;
pub const TABLE_AVFS_FUSE_OVERRIDE: u32 = 4;
pub const TABLE_PMSTATUSLOG: u32 = 5;
pub const TABLE_SMU_METRICS: u32 = 6;
pub const TABLE_DRIVER_SMU_CONFIG: u32 = 7;
pub const TABLE_ACTIVITY_MONITOR_COEFF: u32 = 8;
pub const TABLE_OVERDRIVE: u32 = 9;
pub const TABLE_I2C_COMMANDS: u32 = 10;
pub const TABLE_PACE: u32 = 11;
pub const TABLE_COUNT: u32 = 12;
pub const RLC_PACE_TABLE_NUM_LEVELS: u32 = 16;
pub const UCLK_SWITCH_SLOW: u32 = 0;
pub const UCLK_SWITCH_FAST: u32 = 1;
pub const SMU_11_0_TABLE_FORMAT_REVISION: u32 = 12;
pub const SMU_11_0_PP_PLATFORM_CAP_POWERPLAY: u32 = 1;
pub const SMU_11_0_PP_PLATFORM_CAP_SBIOSPOWERSOURCE: u32 = 2;
pub const SMU_11_0_PP_PLATFORM_CAP_HARDWAREDC: u32 = 4;
pub const SMU_11_0_PP_PLATFORM_CAP_BACO: u32 = 8;
pub const SMU_11_0_PP_PLATFORM_CAP_MACO: u32 = 16;
pub const SMU_11_0_PP_PLATFORM_CAP_SHADOWPSTATE: u32 = 32;
pub const SMU_11_0_PP_THERMALCONTROLLER_NONE: u32 = 0;
pub const SMU_11_0_PP_OVERDRIVE_VERSION: u32 = 2048;
pub const SMU_11_0_PP_POWERSAVINGCLOCK_VERSION: u32 = 256;
pub const SMU_11_0_MAX_ODFEATURE: u32 = 32;
pub const SMU_11_0_MAX_ODSETTING: u32 = 32;
pub const SMU_11_0_MAX_PPCLOCK: u32 = 16;
pub type __u_char = ::core::ffi::c_uchar;
pub type __u_short = ::core::ffi::c_ushort;
pub type __u_int = ::core::ffi::c_uint;
pub type __u_long = ::core::ffi::c_ulong;
pub type __int8_t = ::core::ffi::c_schar;
pub type __uint8_t = ::core::ffi::c_uchar;
pub type __int16_t = ::core::ffi::c_short;
pub type __uint16_t = ::core::ffi::c_ushort;
pub type __int32_t = ::core::ffi::c_int;
pub type __uint32_t = ::core::ffi::c_uint;
pub type __int64_t = ::core::ffi::c_long;
pub type __uint64_t = ::core::ffi::c_ulong;
pub type __int_least8_t = __int8_t;
pub type __uint_least8_t = __uint8_t;
pub type __int_least16_t = __int16_t;
pub type __uint_least16_t = __uint16_t;
pub type __int_least32_t = __int32_t;
pub type __uint_least32_t = __uint32_t;
pub type __int_least64_t = __int64_t;
pub type __uint_least64_t = __uint64_t;
pub type __quad_t = ::core::ffi::c_long;
pub type __u_quad_t = ::core::ffi::c_ulong;
pub type __intmax_t = ::core::ffi::c_long;
pub type __uintmax_t = ::core::ffi::c_ulong;
pub type __dev_t = ::core::ffi::c_ulong;
pub type __uid_t = ::core::ffi::c_uint;
pub type __gid_t = ::core::ffi::c_uint;
pub type __ino_t = ::core::ffi::c_ulong;
pub type __ino64_t = ::core::ffi::c_ulong;
pub type __mode_t = ::core::ffi::c_uint;
pub type __nlink_t = ::core::ffi::c_ulong;
pub type __off_t = ::core::ffi::c_long;
pub type __off64_t = ::core::ffi::c_long;
pub type __pid_t = ::core::ffi::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __fsid_t {
    pub __val: [::core::ffi::c_int; 2usize],
}
#[test]
fn bindgen_test_layout___fsid_t() {
    const UNINIT: ::core::mem::MaybeUninit<__fsid_t> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<__fsid_t>(),
        8usize,
        concat!("Size of: ", stringify!(__fsid_t))
    );
    assert_eq!(
        ::core::mem::align_of::<__fsid_t>(),
        4usize,
        concat!("Alignment of ", stringify!(__fsid_t))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).__val) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__fsid_t),
            "::",
            stringify!(__val)
        )
    );
}
pub type __clock_t = ::core::ffi::c_long;
pub type __rlim_t = ::core::ffi::c_ulong;
pub type __rlim64_t = ::core::ffi::c_ulong;
pub type __id_t = ::core::ffi::c_uint;
pub type __time_t = ::core::ffi::c_long;
pub type __useconds_t = ::core::ffi::c_uint;
pub type __suseconds_t = ::core::ffi::c_long;
pub type __suseconds64_t = ::core::ffi::c_long;
pub type __daddr_t = ::core::ffi::c_int;
pub type __key_t = ::core::ffi::c_int;
pub type __clockid_t = ::core::ffi::c_int;
pub type __timer_t = *mut ::core::ffi::c_void;
pub type __blksize_t = ::core::ffi::c_long;
pub type __blkcnt_t = ::core::ffi::c_long;
pub type __blkcnt64_t = ::core::ffi::c_long;
pub type __fsblkcnt_t = ::core::ffi::c_ulong;
pub type __fsblkcnt64_t = ::core::ffi::c_ulong;
pub type __fsfilcnt_t = ::core::ffi::c_ulong;
pub type __fsfilcnt64_t = ::core::ffi::c_ulong;
pub type __fsword_t = ::core::ffi::c_long;
pub type __ssize_t = ::core::ffi::c_long;
pub type __syscall_slong_t = ::core::ffi::c_long;
pub type __syscall_ulong_t = ::core::ffi::c_ulong;
pub type __loff_t = __off64_t;
pub type __caddr_t = *mut ::core::ffi::c_char;
pub type __intptr_t = ::core::ffi::c_long;
pub type __socklen_t = ::core::ffi::c_uint;
pub type __sig_atomic_t = ::core::ffi::c_int;
pub type int_least8_t = __int_least8_t;
pub type int_least16_t = __int_least16_t;
pub type int_least32_t = __int_least32_t;
pub type int_least64_t = __int_least64_t;
pub type uint_least8_t = __uint_least8_t;
pub type uint_least16_t = __uint_least16_t;
pub type uint_least32_t = __uint_least32_t;
pub type uint_least64_t = __uint_least64_t;
pub type int_fast8_t = ::core::ffi::c_schar;
pub type int_fast16_t = ::core::ffi::c_long;
pub type int_fast32_t = ::core::ffi::c_long;
pub type int_fast64_t = ::core::ffi::c_long;
pub type uint_fast8_t = ::core::ffi::c_uchar;
pub type uint_fast16_t = ::core::ffi::c_ulong;
pub type uint_fast32_t = ::core::ffi::c_ulong;
pub type uint_fast64_t = ::core::ffi::c_ulong;
pub type intmax_t = __intmax_t;
pub type uintmax_t = __uintmax_t;
pub const atom_bios_header_version_def_ATOM_MAJOR_VERSION: atom_bios_header_version_def = 3;
pub const atom_bios_header_version_def_ATOM_MINOR_VERSION: atom_bios_header_version_def = 3;
pub type atom_bios_header_version_def = ::core::ffi::c_uint;
pub const atom_crtc_def_ATOM_CRTC1: atom_crtc_def = 0;
pub const atom_crtc_def_ATOM_CRTC2: atom_crtc_def = 1;
pub const atom_crtc_def_ATOM_CRTC3: atom_crtc_def = 2;
pub const atom_crtc_def_ATOM_CRTC4: atom_crtc_def = 3;
pub const atom_crtc_def_ATOM_CRTC5: atom_crtc_def = 4;
pub const atom_crtc_def_ATOM_CRTC6: atom_crtc_def = 5;
pub const atom_crtc_def_ATOM_CRTC_INVALID: atom_crtc_def = 255;
pub type atom_crtc_def = ::core::ffi::c_uint;
pub const atom_ppll_def_ATOM_PPLL0: atom_ppll_def = 2;
pub const atom_ppll_def_ATOM_GCK_DFS: atom_ppll_def = 8;
pub const atom_ppll_def_ATOM_FCH_CLK: atom_ppll_def = 9;
pub const atom_ppll_def_ATOM_DP_DTO: atom_ppll_def = 11;
pub const atom_ppll_def_ATOM_COMBOPHY_PLL0: atom_ppll_def = 20;
pub const atom_ppll_def_ATOM_COMBOPHY_PLL1: atom_ppll_def = 21;
pub const atom_ppll_def_ATOM_COMBOPHY_PLL2: atom_ppll_def = 22;
pub const atom_ppll_def_ATOM_COMBOPHY_PLL3: atom_ppll_def = 23;
pub const atom_ppll_def_ATOM_COMBOPHY_PLL4: atom_ppll_def = 24;
pub const atom_ppll_def_ATOM_COMBOPHY_PLL5: atom_ppll_def = 25;
pub const atom_ppll_def_ATOM_PPLL_INVALID: atom_ppll_def = 255;
pub type atom_ppll_def = ::core::ffi::c_uint;
pub const atom_dig_def_ASIC_INT_DIG1_ENCODER_ID: atom_dig_def = 3;
pub const atom_dig_def_ASIC_INT_DIG2_ENCODER_ID: atom_dig_def = 9;
pub const atom_dig_def_ASIC_INT_DIG3_ENCODER_ID: atom_dig_def = 10;
pub const atom_dig_def_ASIC_INT_DIG4_ENCODER_ID: atom_dig_def = 11;
pub const atom_dig_def_ASIC_INT_DIG5_ENCODER_ID: atom_dig_def = 12;
pub const atom_dig_def_ASIC_INT_DIG6_ENCODER_ID: atom_dig_def = 13;
pub const atom_dig_def_ASIC_INT_DIG7_ENCODER_ID: atom_dig_def = 14;
pub type atom_dig_def = ::core::ffi::c_uint;
pub const atom_encode_mode_def_ATOM_ENCODER_MODE_DP: atom_encode_mode_def = 0;
pub const atom_encode_mode_def_ATOM_ENCODER_MODE_DP_SST: atom_encode_mode_def = 0;
pub const atom_encode_mode_def_ATOM_ENCODER_MODE_LVDS: atom_encode_mode_def = 1;
pub const atom_encode_mode_def_ATOM_ENCODER_MODE_DVI: atom_encode_mode_def = 2;
pub const atom_encode_mode_def_ATOM_ENCODER_MODE_HDMI: atom_encode_mode_def = 3;
pub const atom_encode_mode_def_ATOM_ENCODER_MODE_DP_AUDIO: atom_encode_mode_def = 5;
pub const atom_encode_mode_def_ATOM_ENCODER_MODE_DP_MST: atom_encode_mode_def = 5;
pub const atom_encode_mode_def_ATOM_ENCODER_MODE_CRT: atom_encode_mode_def = 15;
pub const atom_encode_mode_def_ATOM_ENCODER_MODE_DVO: atom_encode_mode_def = 16;
pub type atom_encode_mode_def = ::core::ffi::c_uint;
pub const atom_encoder_refclk_src_def_ENCODER_REFCLK_SRC_P1PLL: atom_encoder_refclk_src_def = 0;
pub const atom_encoder_refclk_src_def_ENCODER_REFCLK_SRC_P2PLL: atom_encoder_refclk_src_def = 1;
pub const atom_encoder_refclk_src_def_ENCODER_REFCLK_SRC_P3PLL: atom_encoder_refclk_src_def = 2;
pub const atom_encoder_refclk_src_def_ENCODER_REFCLK_SRC_EXTCLK: atom_encoder_refclk_src_def = 3;
pub const atom_encoder_refclk_src_def_ENCODER_REFCLK_SRC_INVALID: atom_encoder_refclk_src_def = 255;
pub type atom_encoder_refclk_src_def = ::core::ffi::c_uint;
pub const atom_scaler_def_ATOM_SCALER_DISABLE: atom_scaler_def = 0;
pub const atom_scaler_def_ATOM_SCALER_CENTER: atom_scaler_def = 1;
pub const atom_scaler_def_ATOM_SCALER_EXPANSION: atom_scaler_def = 2;
pub type atom_scaler_def = ::core::ffi::c_uint;
pub const atom_operation_def_ATOM_DISABLE: atom_operation_def = 0;
pub const atom_operation_def_ATOM_ENABLE: atom_operation_def = 1;
pub const atom_operation_def_ATOM_INIT: atom_operation_def = 7;
pub const atom_operation_def_ATOM_GET_STATUS: atom_operation_def = 8;
pub type atom_operation_def = ::core::ffi::c_uint;
pub const atom_embedded_display_op_def_ATOM_LCD_BL_OFF: atom_embedded_display_op_def = 2;
pub const atom_embedded_display_op_def_ATOM_LCD_BL_OM: atom_embedded_display_op_def = 3;
pub const atom_embedded_display_op_def_ATOM_LCD_BL_BRIGHTNESS_CONTROL:
    atom_embedded_display_op_def = 4;
pub const atom_embedded_display_op_def_ATOM_LCD_SELFTEST_START: atom_embedded_display_op_def = 5;
pub const atom_embedded_display_op_def_ATOM_LCD_SELFTEST_STOP: atom_embedded_display_op_def = 6;
pub type atom_embedded_display_op_def = ::core::ffi::c_uint;
pub const atom_spread_spectrum_mode_ATOM_SS_CENTER_OR_DOWN_MODE_MASK: atom_spread_spectrum_mode = 1;
pub const atom_spread_spectrum_mode_ATOM_SS_DOWN_SPREAD_MODE: atom_spread_spectrum_mode = 0;
pub const atom_spread_spectrum_mode_ATOM_SS_CENTRE_SPREAD_MODE: atom_spread_spectrum_mode = 1;
pub const atom_spread_spectrum_mode_ATOM_INT_OR_EXT_SS_MASK: atom_spread_spectrum_mode = 2;
pub const atom_spread_spectrum_mode_ATOM_INTERNAL_SS_MASK: atom_spread_spectrum_mode = 0;
pub const atom_spread_spectrum_mode_ATOM_EXTERNAL_SS_MASK: atom_spread_spectrum_mode = 2;
pub type atom_spread_spectrum_mode = ::core::ffi::c_uint;
pub const atom_panel_bit_per_color_PANEL_BPC_UNDEFINE: atom_panel_bit_per_color = 0;
pub const atom_panel_bit_per_color_PANEL_6BIT_PER_COLOR: atom_panel_bit_per_color = 1;
pub const atom_panel_bit_per_color_PANEL_8BIT_PER_COLOR: atom_panel_bit_per_color = 2;
pub const atom_panel_bit_per_color_PANEL_10BIT_PER_COLOR: atom_panel_bit_per_color = 3;
pub const atom_panel_bit_per_color_PANEL_12BIT_PER_COLOR: atom_panel_bit_per_color = 4;
pub const atom_panel_bit_per_color_PANEL_16BIT_PER_COLOR: atom_panel_bit_per_color = 5;
pub type atom_panel_bit_per_color = ::core::ffi::c_uint;
pub const atom_voltage_type_VOLTAGE_TYPE_VDDC: atom_voltage_type = 1;
pub const atom_voltage_type_VOLTAGE_TYPE_MVDDC: atom_voltage_type = 2;
pub const atom_voltage_type_VOLTAGE_TYPE_MVDDQ: atom_voltage_type = 3;
pub const atom_voltage_type_VOLTAGE_TYPE_VDDCI: atom_voltage_type = 4;
pub const atom_voltage_type_VOLTAGE_TYPE_VDDGFX: atom_voltage_type = 5;
pub const atom_voltage_type_VOLTAGE_TYPE_PCC: atom_voltage_type = 6;
pub const atom_voltage_type_VOLTAGE_TYPE_MVPP: atom_voltage_type = 7;
pub const atom_voltage_type_VOLTAGE_TYPE_LEDDPM: atom_voltage_type = 8;
pub const atom_voltage_type_VOLTAGE_TYPE_PCC_MVDD: atom_voltage_type = 9;
pub const atom_voltage_type_VOLTAGE_TYPE_PCIE_VDDC: atom_voltage_type = 10;
pub const atom_voltage_type_VOLTAGE_TYPE_PCIE_VDDR: atom_voltage_type = 11;
pub const atom_voltage_type_VOLTAGE_TYPE_GENERIC_I2C_1: atom_voltage_type = 17;
pub const atom_voltage_type_VOLTAGE_TYPE_GENERIC_I2C_2: atom_voltage_type = 18;
pub const atom_voltage_type_VOLTAGE_TYPE_GENERIC_I2C_3: atom_voltage_type = 19;
pub const atom_voltage_type_VOLTAGE_TYPE_GENERIC_I2C_4: atom_voltage_type = 20;
pub const atom_voltage_type_VOLTAGE_TYPE_GENERIC_I2C_5: atom_voltage_type = 21;
pub const atom_voltage_type_VOLTAGE_TYPE_GENERIC_I2C_6: atom_voltage_type = 22;
pub const atom_voltage_type_VOLTAGE_TYPE_GENERIC_I2C_7: atom_voltage_type = 23;
pub const atom_voltage_type_VOLTAGE_TYPE_GENERIC_I2C_8: atom_voltage_type = 24;
pub const atom_voltage_type_VOLTAGE_TYPE_GENERIC_I2C_9: atom_voltage_type = 25;
pub const atom_voltage_type_VOLTAGE_TYPE_GENERIC_I2C_10: atom_voltage_type = 26;
pub type atom_voltage_type = ::core::ffi::c_uint;
pub const atom_dgpu_vram_type_ATOM_DGPU_VRAM_TYPE_GDDR5: atom_dgpu_vram_type = 80;
pub const atom_dgpu_vram_type_ATOM_DGPU_VRAM_TYPE_HBM2: atom_dgpu_vram_type = 96;
pub const atom_dgpu_vram_type_ATOM_DGPU_VRAM_TYPE_HBM2E: atom_dgpu_vram_type = 97;
pub const atom_dgpu_vram_type_ATOM_DGPU_VRAM_TYPE_GDDR6: atom_dgpu_vram_type = 112;
pub const atom_dgpu_vram_type_ATOM_DGPU_VRAM_TYPE_HBM3: atom_dgpu_vram_type = 128;
pub type atom_dgpu_vram_type = ::core::ffi::c_uint;
pub const atom_dp_vs_preemph_def_DP_VS_LEVEL0_PREEMPH_LEVEL0: atom_dp_vs_preemph_def = 0;
pub const atom_dp_vs_preemph_def_DP_VS_LEVEL1_PREEMPH_LEVEL0: atom_dp_vs_preemph_def = 1;
pub const atom_dp_vs_preemph_def_DP_VS_LEVEL2_PREEMPH_LEVEL0: atom_dp_vs_preemph_def = 2;
pub const atom_dp_vs_preemph_def_DP_VS_LEVEL3_PREEMPH_LEVEL0: atom_dp_vs_preemph_def = 3;
pub const atom_dp_vs_preemph_def_DP_VS_LEVEL0_PREEMPH_LEVEL1: atom_dp_vs_preemph_def = 8;
pub const atom_dp_vs_preemph_def_DP_VS_LEVEL1_PREEMPH_LEVEL1: atom_dp_vs_preemph_def = 9;
pub const atom_dp_vs_preemph_def_DP_VS_LEVEL2_PREEMPH_LEVEL1: atom_dp_vs_preemph_def = 10;
pub const atom_dp_vs_preemph_def_DP_VS_LEVEL0_PREEMPH_LEVEL2: atom_dp_vs_preemph_def = 16;
pub const atom_dp_vs_preemph_def_DP_VS_LEVEL1_PREEMPH_LEVEL2: atom_dp_vs_preemph_def = 17;
pub const atom_dp_vs_preemph_def_DP_VS_LEVEL0_PREEMPH_LEVEL3: atom_dp_vs_preemph_def = 24;
pub type atom_dp_vs_preemph_def = ::core::ffi::c_uint;
pub const atombios_image_offset_OFFSET_TO_ATOM_ROM_HEADER_POINTER: atombios_image_offset = 72;
pub const atombios_image_offset_OFFSET_TO_ATOM_ROM_IMAGE_SIZE: atombios_image_offset = 2;
pub const atombios_image_offset_OFFSET_TO_ATOMBIOS_ASIC_BUS_MEM_TYPE: atombios_image_offset = 148;
pub const atombios_image_offset_MAXSIZE_OF_ATOMBIOS_ASIC_BUS_MEM_TYPE: atombios_image_offset = 20;
pub const atombios_image_offset_OFFSET_TO_GET_ATOMBIOS_NUMBER_OF_STRINGS: atombios_image_offset =
    47;
pub const atombios_image_offset_OFFSET_TO_GET_ATOMBIOS_STRING_START: atombios_image_offset = 110;
pub const atombios_image_offset_OFFSET_TO_VBIOS_PART_NUMBER: atombios_image_offset = 128;
pub const atombios_image_offset_OFFSET_TO_VBIOS_DATE: atombios_image_offset = 80;
pub type atombios_image_offset = ::core::ffi::c_uint;
#[doc = " Common header for all tables (Data table, Command function).\n Every table pointed in _ATOM_MASTER_DATA_TABLE has this common header.\n And the pointer actually points to this header."]
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct atom_common_table_header {
    pub structuresize: u16,
    pub format_revision: u8,
    pub content_revision: u8,
}
#[test]
fn bindgen_test_layout_atom_common_table_header() {
    const UNINIT: ::core::mem::MaybeUninit<atom_common_table_header> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<atom_common_table_header>(),
        4usize,
        concat!("Size of: ", stringify!(atom_common_table_header))
    );
    assert_eq!(
        ::core::mem::align_of::<atom_common_table_header>(),
        1usize,
        concat!("Alignment of ", stringify!(atom_common_table_header))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).structuresize) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_common_table_header),
            "::",
            stringify!(structuresize)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).format_revision) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_common_table_header),
            "::",
            stringify!(format_revision)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).content_revision) as usize - ptr as usize },
        3usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_common_table_header),
            "::",
            stringify!(content_revision)
        )
    );
}
#[doc = " Structure stores the ROM header."]
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct atom_rom_header_v2_2 {
    pub table_header: atom_common_table_header,
    pub atom_bios_string: [u8; 4usize],
    pub bios_segment_address: u16,
    pub protectedmodeoffset: u16,
    pub configfilenameoffset: u16,
    pub crc_block_offset: u16,
    pub vbios_bootupmessageoffset: u16,
    pub int10_offset: u16,
    pub pcibusdevinitcode: u16,
    pub iobaseaddress: u16,
    pub subsystem_vendor_id: u16,
    pub subsystem_id: u16,
    pub pci_info_offset: u16,
    pub masterhwfunction_offset: u16,
    pub masterdatatable_offset: u16,
    pub reserved: u16,
    pub pspdirtableoffset: u32,
}
#[test]
fn bindgen_test_layout_atom_rom_header_v2_2() {
    const UNINIT: ::core::mem::MaybeUninit<atom_rom_header_v2_2> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<atom_rom_header_v2_2>(),
        40usize,
        concat!("Size of: ", stringify!(atom_rom_header_v2_2))
    );
    assert_eq!(
        ::core::mem::align_of::<atom_rom_header_v2_2>(),
        1usize,
        concat!("Alignment of ", stringify!(atom_rom_header_v2_2))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).table_header) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_rom_header_v2_2),
            "::",
            stringify!(table_header)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).atom_bios_string) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_rom_header_v2_2),
            "::",
            stringify!(atom_bios_string)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).bios_segment_address) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_rom_header_v2_2),
            "::",
            stringify!(bios_segment_address)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).protectedmodeoffset) as usize - ptr as usize },
        10usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_rom_header_v2_2),
            "::",
            stringify!(protectedmodeoffset)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).configfilenameoffset) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_rom_header_v2_2),
            "::",
            stringify!(configfilenameoffset)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).crc_block_offset) as usize - ptr as usize },
        14usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_rom_header_v2_2),
            "::",
            stringify!(crc_block_offset)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).vbios_bootupmessageoffset) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_rom_header_v2_2),
            "::",
            stringify!(vbios_bootupmessageoffset)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).int10_offset) as usize - ptr as usize },
        18usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_rom_header_v2_2),
            "::",
            stringify!(int10_offset)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).pcibusdevinitcode) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_rom_header_v2_2),
            "::",
            stringify!(pcibusdevinitcode)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).iobaseaddress) as usize - ptr as usize },
        22usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_rom_header_v2_2),
            "::",
            stringify!(iobaseaddress)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).subsystem_vendor_id) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_rom_header_v2_2),
            "::",
            stringify!(subsystem_vendor_id)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).subsystem_id) as usize - ptr as usize },
        26usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_rom_header_v2_2),
            "::",
            stringify!(subsystem_id)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).pci_info_offset) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_rom_header_v2_2),
            "::",
            stringify!(pci_info_offset)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).masterhwfunction_offset) as usize - ptr as usize },
        30usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_rom_header_v2_2),
            "::",
            stringify!(masterhwfunction_offset)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).masterdatatable_offset) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_rom_header_v2_2),
            "::",
            stringify!(masterdatatable_offset)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).reserved) as usize - ptr as usize },
        34usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_rom_header_v2_2),
            "::",
            stringify!(reserved)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).pspdirtableoffset) as usize - ptr as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_rom_header_v2_2),
            "::",
            stringify!(pspdirtableoffset)
        )
    );
}
#[doc = " Structures used in Command.mtb, each function name is not given here since those function could change from time to time\n The real functionality of each function is associated with the parameter structure version when defined\n For all internal cmd function definitions, please reference to atomstruct.h"]
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct atom_master_list_of_command_functions_v2_1 {
    pub asic_init: u16,
    pub cmd_function1: u16,
    pub cmd_function2: u16,
    pub cmd_function3: u16,
    pub digxencodercontrol: u16,
    pub cmd_function5: u16,
    pub cmd_function6: u16,
    pub cmd_function7: u16,
    pub cmd_function8: u16,
    pub cmd_function9: u16,
    pub setengineclock: u16,
    pub setmemoryclock: u16,
    pub setpixelclock: u16,
    pub enabledisppowergating: u16,
    pub cmd_function14: u16,
    pub cmd_function15: u16,
    pub cmd_function16: u16,
    pub cmd_function17: u16,
    pub cmd_function18: u16,
    pub cmd_function19: u16,
    pub cmd_function20: u16,
    pub cmd_function21: u16,
    pub cmd_function22: u16,
    pub cmd_function23: u16,
    pub cmd_function24: u16,
    pub cmd_function25: u16,
    pub cmd_function26: u16,
    pub cmd_function27: u16,
    pub cmd_function28: u16,
    pub cmd_function29: u16,
    pub cmd_function30: u16,
    pub cmd_function31: u16,
    pub cmd_function32: u16,
    pub cmd_function33: u16,
    pub blankcrtc: u16,
    pub enablecrtc: u16,
    pub cmd_function36: u16,
    pub cmd_function37: u16,
    pub cmd_function38: u16,
    pub cmd_function39: u16,
    pub cmd_function40: u16,
    pub getsmuclockinfo: u16,
    pub selectcrtc_source: u16,
    pub cmd_function43: u16,
    pub cmd_function44: u16,
    pub cmd_function45: u16,
    pub setdceclock: u16,
    pub getmemoryclock: u16,
    pub getengineclock: u16,
    pub setcrtc_usingdtdtiming: u16,
    pub externalencodercontrol: u16,
    pub cmd_function51: u16,
    pub cmd_function52: u16,
    pub cmd_function53: u16,
    pub processi2cchanneltransaction: u16,
    pub cmd_function55: u16,
    pub cmd_function56: u16,
    pub cmd_function57: u16,
    pub cmd_function58: u16,
    pub cmd_function59: u16,
    pub computegpuclockparam: u16,
    pub cmd_function61: u16,
    pub cmd_function62: u16,
    pub dynamicmemorysettings: u16,
    pub memorytraining: u16,
    pub cmd_function65: u16,
    pub cmd_function66: u16,
    pub setvoltage: u16,
    pub cmd_function68: u16,
    pub readefusevalue: u16,
    pub cmd_function70: u16,
    pub cmd_function71: u16,
    pub cmd_function72: u16,
    pub cmd_function73: u16,
    pub cmd_function74: u16,
    pub cmd_function75: u16,
    pub dig1transmittercontrol: u16,
    pub cmd_function77: u16,
    pub processauxchanneltransaction: u16,
    pub cmd_function79: u16,
    pub getvoltageinfo: u16,
}
#[test]
fn bindgen_test_layout_atom_master_list_of_command_functions_v2_1() {
    const UNINIT: ::core::mem::MaybeUninit<atom_master_list_of_command_functions_v2_1> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<atom_master_list_of_command_functions_v2_1>(),
        162usize,
        concat!(
            "Size of: ",
            stringify!(atom_master_list_of_command_functions_v2_1)
        )
    );
    assert_eq!(
        ::core::mem::align_of::<atom_master_list_of_command_functions_v2_1>(),
        1usize,
        concat!(
            "Alignment of ",
            stringify!(atom_master_list_of_command_functions_v2_1)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).asic_init) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_master_list_of_command_functions_v2_1),
            "::",
            stringify!(asic_init)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).cmd_function1) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_master_list_of_command_functions_v2_1),
            "::",
            stringify!(cmd_function1)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).cmd_function2) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_master_list_of_command_functions_v2_1),
            "::",
            stringify!(cmd_function2)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).cmd_function3) as usize - ptr as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_master_list_of_command_functions_v2_1),
            "::",
            stringify!(cmd_function3)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).digxencodercontrol) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_master_list_of_command_functions_v2_1),
            "::",
            stringify!(digxencodercontrol)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).cmd_function5) as usize - ptr as usize },
        10usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_master_list_of_command_functions_v2_1),
            "::",
            stringify!(cmd_function5)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).cmd_function6) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_master_list_of_command_functions_v2_1),
            "::",
            stringify!(cmd_function6)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).cmd_function7) as usize - ptr as usize },
        14usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_master_list_of_command_functions_v2_1),
            "::",
            stringify!(cmd_function7)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).cmd_function8) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_master_list_of_command_functions_v2_1),
            "::",
            stringify!(cmd_function8)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).cmd_function9) as usize - ptr as usize },
        18usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_master_list_of_command_functions_v2_1),
            "::",
            stringify!(cmd_function9)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).setengineclock) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_master_list_of_command_functions_v2_1),
            "::",
            stringify!(setengineclock)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).setmemoryclock) as usize - ptr as usize },
        22usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_master_list_of_command_functions_v2_1),
            "::",
            stringify!(setmemoryclock)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).setpixelclock) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_master_list_of_command_functions_v2_1),
            "::",
            stringify!(setpixelclock)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).enabledisppowergating) as usize - ptr as usize },
        26usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_master_list_of_command_functions_v2_1),
            "::",
            stringify!(enabledisppowergating)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).cmd_function14) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_master_list_of_command_functions_v2_1),
            "::",
            stringify!(cmd_function14)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).cmd_function15) as usize - ptr as usize },
        30usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_master_list_of_command_functions_v2_1),
            "::",
            stringify!(cmd_function15)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).cmd_function16) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_master_list_of_command_functions_v2_1),
            "::",
            stringify!(cmd_function16)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).cmd_function17) as usize - ptr as usize },
        34usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_master_list_of_command_functions_v2_1),
            "::",
            stringify!(cmd_function17)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).cmd_function18) as usize - ptr as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_master_list_of_command_functions_v2_1),
            "::",
            stringify!(cmd_function18)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).cmd_function19) as usize - ptr as usize },
        38usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_master_list_of_command_functions_v2_1),
            "::",
            stringify!(cmd_function19)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).cmd_function20) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_master_list_of_command_functions_v2_1),
            "::",
            stringify!(cmd_function20)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).cmd_function21) as usize - ptr as usize },
        42usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_master_list_of_command_functions_v2_1),
            "::",
            stringify!(cmd_function21)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).cmd_function22) as usize - ptr as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_master_list_of_command_functions_v2_1),
            "::",
            stringify!(cmd_function22)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).cmd_function23) as usize - ptr as usize },
        46usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_master_list_of_command_functions_v2_1),
            "::",
            stringify!(cmd_function23)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).cmd_function24) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_master_list_of_command_functions_v2_1),
            "::",
            stringify!(cmd_function24)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).cmd_function25) as usize - ptr as usize },
        50usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_master_list_of_command_functions_v2_1),
            "::",
            stringify!(cmd_function25)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).cmd_function26) as usize - ptr as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_master_list_of_command_functions_v2_1),
            "::",
            stringify!(cmd_function26)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).cmd_function27) as usize - ptr as usize },
        54usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_master_list_of_command_functions_v2_1),
            "::",
            stringify!(cmd_function27)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).cmd_function28) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_master_list_of_command_functions_v2_1),
            "::",
            stringify!(cmd_function28)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).cmd_function29) as usize - ptr as usize },
        58usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_master_list_of_command_functions_v2_1),
            "::",
            stringify!(cmd_function29)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).cmd_function30) as usize - ptr as usize },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_master_list_of_command_functions_v2_1),
            "::",
            stringify!(cmd_function30)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).cmd_function31) as usize - ptr as usize },
        62usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_master_list_of_command_functions_v2_1),
            "::",
            stringify!(cmd_function31)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).cmd_function32) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_master_list_of_command_functions_v2_1),
            "::",
            stringify!(cmd_function32)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).cmd_function33) as usize - ptr as usize },
        66usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_master_list_of_command_functions_v2_1),
            "::",
            stringify!(cmd_function33)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).blankcrtc) as usize - ptr as usize },
        68usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_master_list_of_command_functions_v2_1),
            "::",
            stringify!(blankcrtc)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).enablecrtc) as usize - ptr as usize },
        70usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_master_list_of_command_functions_v2_1),
            "::",
            stringify!(enablecrtc)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).cmd_function36) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_master_list_of_command_functions_v2_1),
            "::",
            stringify!(cmd_function36)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).cmd_function37) as usize - ptr as usize },
        74usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_master_list_of_command_functions_v2_1),
            "::",
            stringify!(cmd_function37)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).cmd_function38) as usize - ptr as usize },
        76usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_master_list_of_command_functions_v2_1),
            "::",
            stringify!(cmd_function38)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).cmd_function39) as usize - ptr as usize },
        78usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_master_list_of_command_functions_v2_1),
            "::",
            stringify!(cmd_function39)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).cmd_function40) as usize - ptr as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_master_list_of_command_functions_v2_1),
            "::",
            stringify!(cmd_function40)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).getsmuclockinfo) as usize - ptr as usize },
        82usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_master_list_of_command_functions_v2_1),
            "::",
            stringify!(getsmuclockinfo)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).selectcrtc_source) as usize - ptr as usize },
        84usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_master_list_of_command_functions_v2_1),
            "::",
            stringify!(selectcrtc_source)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).cmd_function43) as usize - ptr as usize },
        86usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_master_list_of_command_functions_v2_1),
            "::",
            stringify!(cmd_function43)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).cmd_function44) as usize - ptr as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_master_list_of_command_functions_v2_1),
            "::",
            stringify!(cmd_function44)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).cmd_function45) as usize - ptr as usize },
        90usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_master_list_of_command_functions_v2_1),
            "::",
            stringify!(cmd_function45)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).setdceclock) as usize - ptr as usize },
        92usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_master_list_of_command_functions_v2_1),
            "::",
            stringify!(setdceclock)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).getmemoryclock) as usize - ptr as usize },
        94usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_master_list_of_command_functions_v2_1),
            "::",
            stringify!(getmemoryclock)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).getengineclock) as usize - ptr as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_master_list_of_command_functions_v2_1),
            "::",
            stringify!(getengineclock)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).setcrtc_usingdtdtiming) as usize - ptr as usize },
        98usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_master_list_of_command_functions_v2_1),
            "::",
            stringify!(setcrtc_usingdtdtiming)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).externalencodercontrol) as usize - ptr as usize },
        100usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_master_list_of_command_functions_v2_1),
            "::",
            stringify!(externalencodercontrol)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).cmd_function51) as usize - ptr as usize },
        102usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_master_list_of_command_functions_v2_1),
            "::",
            stringify!(cmd_function51)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).cmd_function52) as usize - ptr as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_master_list_of_command_functions_v2_1),
            "::",
            stringify!(cmd_function52)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).cmd_function53) as usize - ptr as usize },
        106usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_master_list_of_command_functions_v2_1),
            "::",
            stringify!(cmd_function53)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).processi2cchanneltransaction) as usize - ptr as usize
        },
        108usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_master_list_of_command_functions_v2_1),
            "::",
            stringify!(processi2cchanneltransaction)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).cmd_function55) as usize - ptr as usize },
        110usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_master_list_of_command_functions_v2_1),
            "::",
            stringify!(cmd_function55)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).cmd_function56) as usize - ptr as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_master_list_of_command_functions_v2_1),
            "::",
            stringify!(cmd_function56)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).cmd_function57) as usize - ptr as usize },
        114usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_master_list_of_command_functions_v2_1),
            "::",
            stringify!(cmd_function57)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).cmd_function58) as usize - ptr as usize },
        116usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_master_list_of_command_functions_v2_1),
            "::",
            stringify!(cmd_function58)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).cmd_function59) as usize - ptr as usize },
        118usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_master_list_of_command_functions_v2_1),
            "::",
            stringify!(cmd_function59)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).computegpuclockparam) as usize - ptr as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_master_list_of_command_functions_v2_1),
            "::",
            stringify!(computegpuclockparam)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).cmd_function61) as usize - ptr as usize },
        122usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_master_list_of_command_functions_v2_1),
            "::",
            stringify!(cmd_function61)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).cmd_function62) as usize - ptr as usize },
        124usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_master_list_of_command_functions_v2_1),
            "::",
            stringify!(cmd_function62)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).dynamicmemorysettings) as usize - ptr as usize },
        126usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_master_list_of_command_functions_v2_1),
            "::",
            stringify!(dynamicmemorysettings)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).memorytraining) as usize - ptr as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_master_list_of_command_functions_v2_1),
            "::",
            stringify!(memorytraining)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).cmd_function65) as usize - ptr as usize },
        130usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_master_list_of_command_functions_v2_1),
            "::",
            stringify!(cmd_function65)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).cmd_function66) as usize - ptr as usize },
        132usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_master_list_of_command_functions_v2_1),
            "::",
            stringify!(cmd_function66)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).setvoltage) as usize - ptr as usize },
        134usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_master_list_of_command_functions_v2_1),
            "::",
            stringify!(setvoltage)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).cmd_function68) as usize - ptr as usize },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_master_list_of_command_functions_v2_1),
            "::",
            stringify!(cmd_function68)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).readefusevalue) as usize - ptr as usize },
        138usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_master_list_of_command_functions_v2_1),
            "::",
            stringify!(readefusevalue)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).cmd_function70) as usize - ptr as usize },
        140usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_master_list_of_command_functions_v2_1),
            "::",
            stringify!(cmd_function70)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).cmd_function71) as usize - ptr as usize },
        142usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_master_list_of_command_functions_v2_1),
            "::",
            stringify!(cmd_function71)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).cmd_function72) as usize - ptr as usize },
        144usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_master_list_of_command_functions_v2_1),
            "::",
            stringify!(cmd_function72)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).cmd_function73) as usize - ptr as usize },
        146usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_master_list_of_command_functions_v2_1),
            "::",
            stringify!(cmd_function73)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).cmd_function74) as usize - ptr as usize },
        148usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_master_list_of_command_functions_v2_1),
            "::",
            stringify!(cmd_function74)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).cmd_function75) as usize - ptr as usize },
        150usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_master_list_of_command_functions_v2_1),
            "::",
            stringify!(cmd_function75)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).dig1transmittercontrol) as usize - ptr as usize },
        152usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_master_list_of_command_functions_v2_1),
            "::",
            stringify!(dig1transmittercontrol)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).cmd_function77) as usize - ptr as usize },
        154usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_master_list_of_command_functions_v2_1),
            "::",
            stringify!(cmd_function77)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).processauxchanneltransaction) as usize - ptr as usize
        },
        156usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_master_list_of_command_functions_v2_1),
            "::",
            stringify!(processauxchanneltransaction)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).cmd_function79) as usize - ptr as usize },
        158usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_master_list_of_command_functions_v2_1),
            "::",
            stringify!(cmd_function79)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).getvoltageinfo) as usize - ptr as usize },
        160usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_master_list_of_command_functions_v2_1),
            "::",
            stringify!(getvoltageinfo)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct atom_master_command_function_v2_1 {
    pub table_header: atom_common_table_header,
    pub listofcmdfunctions: atom_master_list_of_command_functions_v2_1,
}
#[test]
fn bindgen_test_layout_atom_master_command_function_v2_1() {
    const UNINIT: ::core::mem::MaybeUninit<atom_master_command_function_v2_1> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<atom_master_command_function_v2_1>(),
        166usize,
        concat!("Size of: ", stringify!(atom_master_command_function_v2_1))
    );
    assert_eq!(
        ::core::mem::align_of::<atom_master_command_function_v2_1>(),
        1usize,
        concat!(
            "Alignment of ",
            stringify!(atom_master_command_function_v2_1)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).table_header) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_master_command_function_v2_1),
            "::",
            stringify!(table_header)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).listofcmdfunctions) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_master_command_function_v2_1),
            "::",
            stringify!(listofcmdfunctions)
        )
    );
}
#[doc = " Structures used in every command function"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct atom_function_attribute {
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 2usize]>,
}
#[test]
fn bindgen_test_layout_atom_function_attribute() {
    assert_eq!(
        ::core::mem::size_of::<atom_function_attribute>(),
        2usize,
        concat!("Size of: ", stringify!(atom_function_attribute))
    );
    assert_eq!(
        ::core::mem::align_of::<atom_function_attribute>(),
        1usize,
        concat!("Alignment of ", stringify!(atom_function_attribute))
    );
}
impl atom_function_attribute {
    #[inline]
    pub fn ws_in_bytes(&self) -> u16 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 8u8) as u16) }
    }
    #[inline]
    pub fn set_ws_in_bytes(&mut self, val: u16) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 8u8, val as u64)
        }
    }
    #[inline]
    pub fn ps_in_bytes(&self) -> u16 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(8usize, 7u8) as u16) }
    }
    #[inline]
    pub fn set_ps_in_bytes(&mut self, val: u16) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(8usize, 7u8, val as u64)
        }
    }
    #[inline]
    pub fn updated_by_util(&self) -> u16 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(15usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_updated_by_util(&mut self, val: u16) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(15usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        ws_in_bytes: u16,
        ps_in_bytes: u16,
        updated_by_util: u16,
    ) -> __BindgenBitfieldUnit<[u8; 2usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 2usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 8u8, {
            let ws_in_bytes: u16 = unsafe { ::core::mem::transmute(ws_in_bytes) };
            ws_in_bytes as u64
        });
        __bindgen_bitfield_unit.set(8usize, 7u8, {
            let ps_in_bytes: u16 = unsafe { ::core::mem::transmute(ps_in_bytes) };
            ps_in_bytes as u64
        });
        __bindgen_bitfield_unit.set(15usize, 1u8, {
            let updated_by_util: u16 = unsafe { ::core::mem::transmute(updated_by_util) };
            updated_by_util as u64
        });
        __bindgen_bitfield_unit
    }
}
#[doc = " Common header for all hw functions.\n Every function pointed by _master_list_of_hw_function has this common header.\n And the pointer actually points to this header."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct atom_rom_hw_function_header {
    pub func_header: atom_common_table_header,
    pub func_attrib: atom_function_attribute,
}
#[test]
fn bindgen_test_layout_atom_rom_hw_function_header() {
    const UNINIT: ::core::mem::MaybeUninit<atom_rom_hw_function_header> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<atom_rom_hw_function_header>(),
        6usize,
        concat!("Size of: ", stringify!(atom_rom_hw_function_header))
    );
    assert_eq!(
        ::core::mem::align_of::<atom_rom_hw_function_header>(),
        1usize,
        concat!("Alignment of ", stringify!(atom_rom_hw_function_header))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).func_header) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_rom_hw_function_header),
            "::",
            stringify!(func_header)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).func_attrib) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_rom_hw_function_header),
            "::",
            stringify!(func_attrib)
        )
    );
}
#[doc = " Structures used in data.mtb, each data table name is not given here since those data table could change from time to time\n The real name of each table is given when its data structure version is defined"]
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct atom_master_list_of_data_tables_v2_1 {
    pub utilitypipeline: u16,
    pub multimedia_info: u16,
    pub smc_dpm_info: u16,
    pub sw_datatable3: u16,
    pub firmwareinfo: u16,
    pub sw_datatable5: u16,
    pub lcd_info: u16,
    pub sw_datatable7: u16,
    pub smu_info: u16,
    pub sw_datatable9: u16,
    pub sw_datatable10: u16,
    pub vram_usagebyfirmware: u16,
    pub gpio_pin_lut: u16,
    pub sw_datatable13: u16,
    pub gfx_info: u16,
    pub powerplayinfo: u16,
    pub sw_datatable16: u16,
    pub sw_datatable17: u16,
    pub sw_datatable18: u16,
    pub sw_datatable19: u16,
    pub sw_datatable20: u16,
    pub sw_datatable21: u16,
    pub displayobjectinfo: u16,
    pub indirectioaccess: u16,
    pub umc_info: u16,
    pub sw_datatable25: u16,
    pub sw_datatable26: u16,
    pub dce_info: u16,
    pub vram_info: u16,
    pub sw_datatable29: u16,
    pub integratedsysteminfo: u16,
    pub asic_profiling_info: u16,
    pub voltageobject_info: u16,
    pub sw_datatable33: u16,
    pub sw_datatable34: u16,
}
#[test]
fn bindgen_test_layout_atom_master_list_of_data_tables_v2_1() {
    const UNINIT: ::core::mem::MaybeUninit<atom_master_list_of_data_tables_v2_1> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<atom_master_list_of_data_tables_v2_1>(),
        70usize,
        concat!(
            "Size of: ",
            stringify!(atom_master_list_of_data_tables_v2_1)
        )
    );
    assert_eq!(
        ::core::mem::align_of::<atom_master_list_of_data_tables_v2_1>(),
        1usize,
        concat!(
            "Alignment of ",
            stringify!(atom_master_list_of_data_tables_v2_1)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).utilitypipeline) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_master_list_of_data_tables_v2_1),
            "::",
            stringify!(utilitypipeline)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).multimedia_info) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_master_list_of_data_tables_v2_1),
            "::",
            stringify!(multimedia_info)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).smc_dpm_info) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_master_list_of_data_tables_v2_1),
            "::",
            stringify!(smc_dpm_info)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).sw_datatable3) as usize - ptr as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_master_list_of_data_tables_v2_1),
            "::",
            stringify!(sw_datatable3)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).firmwareinfo) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_master_list_of_data_tables_v2_1),
            "::",
            stringify!(firmwareinfo)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).sw_datatable5) as usize - ptr as usize },
        10usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_master_list_of_data_tables_v2_1),
            "::",
            stringify!(sw_datatable5)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).lcd_info) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_master_list_of_data_tables_v2_1),
            "::",
            stringify!(lcd_info)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).sw_datatable7) as usize - ptr as usize },
        14usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_master_list_of_data_tables_v2_1),
            "::",
            stringify!(sw_datatable7)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).smu_info) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_master_list_of_data_tables_v2_1),
            "::",
            stringify!(smu_info)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).sw_datatable9) as usize - ptr as usize },
        18usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_master_list_of_data_tables_v2_1),
            "::",
            stringify!(sw_datatable9)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).sw_datatable10) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_master_list_of_data_tables_v2_1),
            "::",
            stringify!(sw_datatable10)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).vram_usagebyfirmware) as usize - ptr as usize },
        22usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_master_list_of_data_tables_v2_1),
            "::",
            stringify!(vram_usagebyfirmware)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).gpio_pin_lut) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_master_list_of_data_tables_v2_1),
            "::",
            stringify!(gpio_pin_lut)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).sw_datatable13) as usize - ptr as usize },
        26usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_master_list_of_data_tables_v2_1),
            "::",
            stringify!(sw_datatable13)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).gfx_info) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_master_list_of_data_tables_v2_1),
            "::",
            stringify!(gfx_info)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).powerplayinfo) as usize - ptr as usize },
        30usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_master_list_of_data_tables_v2_1),
            "::",
            stringify!(powerplayinfo)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).sw_datatable16) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_master_list_of_data_tables_v2_1),
            "::",
            stringify!(sw_datatable16)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).sw_datatable17) as usize - ptr as usize },
        34usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_master_list_of_data_tables_v2_1),
            "::",
            stringify!(sw_datatable17)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).sw_datatable18) as usize - ptr as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_master_list_of_data_tables_v2_1),
            "::",
            stringify!(sw_datatable18)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).sw_datatable19) as usize - ptr as usize },
        38usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_master_list_of_data_tables_v2_1),
            "::",
            stringify!(sw_datatable19)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).sw_datatable20) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_master_list_of_data_tables_v2_1),
            "::",
            stringify!(sw_datatable20)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).sw_datatable21) as usize - ptr as usize },
        42usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_master_list_of_data_tables_v2_1),
            "::",
            stringify!(sw_datatable21)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).displayobjectinfo) as usize - ptr as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_master_list_of_data_tables_v2_1),
            "::",
            stringify!(displayobjectinfo)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).indirectioaccess) as usize - ptr as usize },
        46usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_master_list_of_data_tables_v2_1),
            "::",
            stringify!(indirectioaccess)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).umc_info) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_master_list_of_data_tables_v2_1),
            "::",
            stringify!(umc_info)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).sw_datatable25) as usize - ptr as usize },
        50usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_master_list_of_data_tables_v2_1),
            "::",
            stringify!(sw_datatable25)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).sw_datatable26) as usize - ptr as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_master_list_of_data_tables_v2_1),
            "::",
            stringify!(sw_datatable26)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).dce_info) as usize - ptr as usize },
        54usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_master_list_of_data_tables_v2_1),
            "::",
            stringify!(dce_info)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).vram_info) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_master_list_of_data_tables_v2_1),
            "::",
            stringify!(vram_info)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).sw_datatable29) as usize - ptr as usize },
        58usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_master_list_of_data_tables_v2_1),
            "::",
            stringify!(sw_datatable29)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).integratedsysteminfo) as usize - ptr as usize },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_master_list_of_data_tables_v2_1),
            "::",
            stringify!(integratedsysteminfo)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).asic_profiling_info) as usize - ptr as usize },
        62usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_master_list_of_data_tables_v2_1),
            "::",
            stringify!(asic_profiling_info)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).voltageobject_info) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_master_list_of_data_tables_v2_1),
            "::",
            stringify!(voltageobject_info)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).sw_datatable33) as usize - ptr as usize },
        66usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_master_list_of_data_tables_v2_1),
            "::",
            stringify!(sw_datatable33)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).sw_datatable34) as usize - ptr as usize },
        68usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_master_list_of_data_tables_v2_1),
            "::",
            stringify!(sw_datatable34)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct atom_master_data_table_v2_1 {
    pub table_header: atom_common_table_header,
    pub listOfdatatables: atom_master_list_of_data_tables_v2_1,
}
#[test]
fn bindgen_test_layout_atom_master_data_table_v2_1() {
    const UNINIT: ::core::mem::MaybeUninit<atom_master_data_table_v2_1> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<atom_master_data_table_v2_1>(),
        74usize,
        concat!("Size of: ", stringify!(atom_master_data_table_v2_1))
    );
    assert_eq!(
        ::core::mem::align_of::<atom_master_data_table_v2_1>(),
        1usize,
        concat!("Alignment of ", stringify!(atom_master_data_table_v2_1))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).table_header) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_master_data_table_v2_1),
            "::",
            stringify!(table_header)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).listOfdatatables) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_master_data_table_v2_1),
            "::",
            stringify!(listOfdatatables)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct atom_dtd_format {
    pub pixclk: u16,
    pub h_active: u16,
    pub h_blanking_time: u16,
    pub v_active: u16,
    pub v_blanking_time: u16,
    pub h_sync_offset: u16,
    pub h_sync_width: u16,
    pub v_sync_offset: u16,
    pub v_syncwidth: u16,
    pub reserved: u16,
    pub reserved0: u16,
    pub h_border: u8,
    pub v_border: u8,
    pub miscinfo: u16,
    pub atom_mode_id: u8,
    pub refreshrate: u8,
}
#[test]
fn bindgen_test_layout_atom_dtd_format() {
    const UNINIT: ::core::mem::MaybeUninit<atom_dtd_format> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<atom_dtd_format>(),
        28usize,
        concat!("Size of: ", stringify!(atom_dtd_format))
    );
    assert_eq!(
        ::core::mem::align_of::<atom_dtd_format>(),
        1usize,
        concat!("Alignment of ", stringify!(atom_dtd_format))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).pixclk) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_dtd_format),
            "::",
            stringify!(pixclk)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).h_active) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_dtd_format),
            "::",
            stringify!(h_active)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).h_blanking_time) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_dtd_format),
            "::",
            stringify!(h_blanking_time)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).v_active) as usize - ptr as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_dtd_format),
            "::",
            stringify!(v_active)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).v_blanking_time) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_dtd_format),
            "::",
            stringify!(v_blanking_time)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).h_sync_offset) as usize - ptr as usize },
        10usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_dtd_format),
            "::",
            stringify!(h_sync_offset)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).h_sync_width) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_dtd_format),
            "::",
            stringify!(h_sync_width)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).v_sync_offset) as usize - ptr as usize },
        14usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_dtd_format),
            "::",
            stringify!(v_sync_offset)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).v_syncwidth) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_dtd_format),
            "::",
            stringify!(v_syncwidth)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).reserved) as usize - ptr as usize },
        18usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_dtd_format),
            "::",
            stringify!(reserved)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).reserved0) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_dtd_format),
            "::",
            stringify!(reserved0)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).h_border) as usize - ptr as usize },
        22usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_dtd_format),
            "::",
            stringify!(h_border)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).v_border) as usize - ptr as usize },
        23usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_dtd_format),
            "::",
            stringify!(v_border)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).miscinfo) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_dtd_format),
            "::",
            stringify!(miscinfo)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).atom_mode_id) as usize - ptr as usize },
        26usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_dtd_format),
            "::",
            stringify!(atom_mode_id)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).refreshrate) as usize - ptr as usize },
        27usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_dtd_format),
            "::",
            stringify!(refreshrate)
        )
    );
}
pub const atom_dtd_format_modemiscinfo_ATOM_HSYNC_POLARITY: atom_dtd_format_modemiscinfo = 2;
pub const atom_dtd_format_modemiscinfo_ATOM_VSYNC_POLARITY: atom_dtd_format_modemiscinfo = 4;
pub const atom_dtd_format_modemiscinfo_ATOM_H_REPLICATIONBY2: atom_dtd_format_modemiscinfo = 16;
pub const atom_dtd_format_modemiscinfo_ATOM_V_REPLICATIONBY2: atom_dtd_format_modemiscinfo = 32;
pub const atom_dtd_format_modemiscinfo_ATOM_INTERLACE: atom_dtd_format_modemiscinfo = 128;
pub const atom_dtd_format_modemiscinfo_ATOM_COMPOSITESYNC: atom_dtd_format_modemiscinfo = 64;
pub type atom_dtd_format_modemiscinfo = ::core::ffi::c_uint;
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct atom_firmware_info_v3_1 {
    pub table_header: atom_common_table_header,
    pub firmware_revision: u32,
    pub bootup_sclk_in10khz: u32,
    pub bootup_mclk_in10khz: u32,
    pub firmware_capability: u32,
    pub main_call_parser_entry: u32,
    pub bios_scratch_reg_startaddr: u32,
    pub bootup_vddc_mv: u16,
    pub bootup_vddci_mv: u16,
    pub bootup_mvddc_mv: u16,
    pub bootup_vddgfx_mv: u16,
    pub mem_module_id: u8,
    pub coolingsolution_id: u8,
    pub reserved1: [u8; 2usize],
    pub mc_baseaddr_high: u32,
    pub mc_baseaddr_low: u32,
    pub reserved2: [u32; 6usize],
}
#[test]
fn bindgen_test_layout_atom_firmware_info_v3_1() {
    const UNINIT: ::core::mem::MaybeUninit<atom_firmware_info_v3_1> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<atom_firmware_info_v3_1>(),
        72usize,
        concat!("Size of: ", stringify!(atom_firmware_info_v3_1))
    );
    assert_eq!(
        ::core::mem::align_of::<atom_firmware_info_v3_1>(),
        1usize,
        concat!("Alignment of ", stringify!(atom_firmware_info_v3_1))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).table_header) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_firmware_info_v3_1),
            "::",
            stringify!(table_header)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).firmware_revision) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_firmware_info_v3_1),
            "::",
            stringify!(firmware_revision)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).bootup_sclk_in10khz) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_firmware_info_v3_1),
            "::",
            stringify!(bootup_sclk_in10khz)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).bootup_mclk_in10khz) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_firmware_info_v3_1),
            "::",
            stringify!(bootup_mclk_in10khz)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).firmware_capability) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_firmware_info_v3_1),
            "::",
            stringify!(firmware_capability)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).main_call_parser_entry) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_firmware_info_v3_1),
            "::",
            stringify!(main_call_parser_entry)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).bios_scratch_reg_startaddr) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_firmware_info_v3_1),
            "::",
            stringify!(bios_scratch_reg_startaddr)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).bootup_vddc_mv) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_firmware_info_v3_1),
            "::",
            stringify!(bootup_vddc_mv)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).bootup_vddci_mv) as usize - ptr as usize },
        30usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_firmware_info_v3_1),
            "::",
            stringify!(bootup_vddci_mv)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).bootup_mvddc_mv) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_firmware_info_v3_1),
            "::",
            stringify!(bootup_mvddc_mv)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).bootup_vddgfx_mv) as usize - ptr as usize },
        34usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_firmware_info_v3_1),
            "::",
            stringify!(bootup_vddgfx_mv)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).mem_module_id) as usize - ptr as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_firmware_info_v3_1),
            "::",
            stringify!(mem_module_id)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).coolingsolution_id) as usize - ptr as usize },
        37usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_firmware_info_v3_1),
            "::",
            stringify!(coolingsolution_id)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).reserved1) as usize - ptr as usize },
        38usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_firmware_info_v3_1),
            "::",
            stringify!(reserved1)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).mc_baseaddr_high) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_firmware_info_v3_1),
            "::",
            stringify!(mc_baseaddr_high)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).mc_baseaddr_low) as usize - ptr as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_firmware_info_v3_1),
            "::",
            stringify!(mc_baseaddr_low)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).reserved2) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_firmware_info_v3_1),
            "::",
            stringify!(reserved2)
        )
    );
}
pub const atombios_firmware_capability_ATOM_FIRMWARE_CAP_FIRMWARE_POSTED:
    atombios_firmware_capability = 1;
pub const atombios_firmware_capability_ATOM_FIRMWARE_CAP_GPU_VIRTUALIZATION:
    atombios_firmware_capability = 2;
pub const atombios_firmware_capability_ATOM_FIRMWARE_CAP_WMI_SUPPORT: atombios_firmware_capability =
    64;
pub const atombios_firmware_capability_ATOM_FIRMWARE_CAP_HWEMU_ENABLE:
    atombios_firmware_capability = 128;
pub const atombios_firmware_capability_ATOM_FIRMWARE_CAP_HWEMU_UMC_CFG:
    atombios_firmware_capability = 256;
pub const atombios_firmware_capability_ATOM_FIRMWARE_CAP_SRAM_ECC: atombios_firmware_capability =
    512;
pub const atombios_firmware_capability_ATOM_FIRMWARE_CAP_ENABLE_2STAGE_BIST_TRAINING:
    atombios_firmware_capability = 1024;
pub const atombios_firmware_capability_ATOM_FIRMWARE_CAP_ENABLE_2ND_USB20PORT:
    atombios_firmware_capability = 32768;
pub const atombios_firmware_capability_ATOM_FIRMWARE_CAP_DYNAMIC_BOOT_CFG_ENABLE:
    atombios_firmware_capability = 131072;
pub type atombios_firmware_capability = ::core::ffi::c_uint;
pub const atom_cooling_solution_id_AIR_COOLING: atom_cooling_solution_id = 0;
pub const atom_cooling_solution_id_LIQUID_COOLING: atom_cooling_solution_id = 1;
pub type atom_cooling_solution_id = ::core::ffi::c_uint;
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct atom_firmware_info_v3_2 {
    pub table_header: atom_common_table_header,
    pub firmware_revision: u32,
    pub bootup_sclk_in10khz: u32,
    pub bootup_mclk_in10khz: u32,
    pub firmware_capability: u32,
    pub main_call_parser_entry: u32,
    pub bios_scratch_reg_startaddr: u32,
    pub bootup_vddc_mv: u16,
    pub bootup_vddci_mv: u16,
    pub bootup_mvddc_mv: u16,
    pub bootup_vddgfx_mv: u16,
    pub mem_module_id: u8,
    pub coolingsolution_id: u8,
    pub reserved1: [u8; 2usize],
    pub mc_baseaddr_high: u32,
    pub mc_baseaddr_low: u32,
    pub board_i2c_feature_id: u8,
    pub board_i2c_feature_gpio_id: u8,
    pub board_i2c_feature_slave_addr: u8,
    pub reserved3: u8,
    pub bootup_mvddq_mv: u16,
    pub bootup_mvpp_mv: u16,
    pub zfbstartaddrin16mb: u32,
    pub reserved2: [u32; 3usize],
}
#[test]
fn bindgen_test_layout_atom_firmware_info_v3_2() {
    const UNINIT: ::core::mem::MaybeUninit<atom_firmware_info_v3_2> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<atom_firmware_info_v3_2>(),
        72usize,
        concat!("Size of: ", stringify!(atom_firmware_info_v3_2))
    );
    assert_eq!(
        ::core::mem::align_of::<atom_firmware_info_v3_2>(),
        1usize,
        concat!("Alignment of ", stringify!(atom_firmware_info_v3_2))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).table_header) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_firmware_info_v3_2),
            "::",
            stringify!(table_header)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).firmware_revision) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_firmware_info_v3_2),
            "::",
            stringify!(firmware_revision)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).bootup_sclk_in10khz) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_firmware_info_v3_2),
            "::",
            stringify!(bootup_sclk_in10khz)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).bootup_mclk_in10khz) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_firmware_info_v3_2),
            "::",
            stringify!(bootup_mclk_in10khz)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).firmware_capability) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_firmware_info_v3_2),
            "::",
            stringify!(firmware_capability)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).main_call_parser_entry) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_firmware_info_v3_2),
            "::",
            stringify!(main_call_parser_entry)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).bios_scratch_reg_startaddr) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_firmware_info_v3_2),
            "::",
            stringify!(bios_scratch_reg_startaddr)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).bootup_vddc_mv) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_firmware_info_v3_2),
            "::",
            stringify!(bootup_vddc_mv)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).bootup_vddci_mv) as usize - ptr as usize },
        30usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_firmware_info_v3_2),
            "::",
            stringify!(bootup_vddci_mv)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).bootup_mvddc_mv) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_firmware_info_v3_2),
            "::",
            stringify!(bootup_mvddc_mv)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).bootup_vddgfx_mv) as usize - ptr as usize },
        34usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_firmware_info_v3_2),
            "::",
            stringify!(bootup_vddgfx_mv)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).mem_module_id) as usize - ptr as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_firmware_info_v3_2),
            "::",
            stringify!(mem_module_id)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).coolingsolution_id) as usize - ptr as usize },
        37usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_firmware_info_v3_2),
            "::",
            stringify!(coolingsolution_id)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).reserved1) as usize - ptr as usize },
        38usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_firmware_info_v3_2),
            "::",
            stringify!(reserved1)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).mc_baseaddr_high) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_firmware_info_v3_2),
            "::",
            stringify!(mc_baseaddr_high)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).mc_baseaddr_low) as usize - ptr as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_firmware_info_v3_2),
            "::",
            stringify!(mc_baseaddr_low)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).board_i2c_feature_id) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_firmware_info_v3_2),
            "::",
            stringify!(board_i2c_feature_id)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).board_i2c_feature_gpio_id) as usize - ptr as usize },
        49usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_firmware_info_v3_2),
            "::",
            stringify!(board_i2c_feature_gpio_id)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).board_i2c_feature_slave_addr) as usize - ptr as usize
        },
        50usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_firmware_info_v3_2),
            "::",
            stringify!(board_i2c_feature_slave_addr)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).reserved3) as usize - ptr as usize },
        51usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_firmware_info_v3_2),
            "::",
            stringify!(reserved3)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).bootup_mvddq_mv) as usize - ptr as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_firmware_info_v3_2),
            "::",
            stringify!(bootup_mvddq_mv)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).bootup_mvpp_mv) as usize - ptr as usize },
        54usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_firmware_info_v3_2),
            "::",
            stringify!(bootup_mvpp_mv)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).zfbstartaddrin16mb) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_firmware_info_v3_2),
            "::",
            stringify!(zfbstartaddrin16mb)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).reserved2) as usize - ptr as usize },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_firmware_info_v3_2),
            "::",
            stringify!(reserved2)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct atom_firmware_info_v3_3 {
    pub table_header: atom_common_table_header,
    pub firmware_revision: u32,
    pub bootup_sclk_in10khz: u32,
    pub bootup_mclk_in10khz: u32,
    pub firmware_capability: u32,
    pub main_call_parser_entry: u32,
    pub bios_scratch_reg_startaddr: u32,
    pub bootup_vddc_mv: u16,
    pub bootup_vddci_mv: u16,
    pub bootup_mvddc_mv: u16,
    pub bootup_vddgfx_mv: u16,
    pub mem_module_id: u8,
    pub coolingsolution_id: u8,
    pub reserved1: [u8; 2usize],
    pub mc_baseaddr_high: u32,
    pub mc_baseaddr_low: u32,
    pub board_i2c_feature_id: u8,
    pub board_i2c_feature_gpio_id: u8,
    pub board_i2c_feature_slave_addr: u8,
    pub reserved3: u8,
    pub bootup_mvddq_mv: u16,
    pub bootup_mvpp_mv: u16,
    pub zfbstartaddrin16mb: u32,
    pub pplib_pptable_id: u32,
    pub reserved2: [u32; 2usize],
}
#[test]
fn bindgen_test_layout_atom_firmware_info_v3_3() {
    const UNINIT: ::core::mem::MaybeUninit<atom_firmware_info_v3_3> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<atom_firmware_info_v3_3>(),
        72usize,
        concat!("Size of: ", stringify!(atom_firmware_info_v3_3))
    );
    assert_eq!(
        ::core::mem::align_of::<atom_firmware_info_v3_3>(),
        1usize,
        concat!("Alignment of ", stringify!(atom_firmware_info_v3_3))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).table_header) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_firmware_info_v3_3),
            "::",
            stringify!(table_header)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).firmware_revision) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_firmware_info_v3_3),
            "::",
            stringify!(firmware_revision)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).bootup_sclk_in10khz) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_firmware_info_v3_3),
            "::",
            stringify!(bootup_sclk_in10khz)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).bootup_mclk_in10khz) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_firmware_info_v3_3),
            "::",
            stringify!(bootup_mclk_in10khz)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).firmware_capability) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_firmware_info_v3_3),
            "::",
            stringify!(firmware_capability)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).main_call_parser_entry) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_firmware_info_v3_3),
            "::",
            stringify!(main_call_parser_entry)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).bios_scratch_reg_startaddr) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_firmware_info_v3_3),
            "::",
            stringify!(bios_scratch_reg_startaddr)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).bootup_vddc_mv) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_firmware_info_v3_3),
            "::",
            stringify!(bootup_vddc_mv)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).bootup_vddci_mv) as usize - ptr as usize },
        30usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_firmware_info_v3_3),
            "::",
            stringify!(bootup_vddci_mv)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).bootup_mvddc_mv) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_firmware_info_v3_3),
            "::",
            stringify!(bootup_mvddc_mv)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).bootup_vddgfx_mv) as usize - ptr as usize },
        34usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_firmware_info_v3_3),
            "::",
            stringify!(bootup_vddgfx_mv)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).mem_module_id) as usize - ptr as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_firmware_info_v3_3),
            "::",
            stringify!(mem_module_id)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).coolingsolution_id) as usize - ptr as usize },
        37usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_firmware_info_v3_3),
            "::",
            stringify!(coolingsolution_id)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).reserved1) as usize - ptr as usize },
        38usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_firmware_info_v3_3),
            "::",
            stringify!(reserved1)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).mc_baseaddr_high) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_firmware_info_v3_3),
            "::",
            stringify!(mc_baseaddr_high)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).mc_baseaddr_low) as usize - ptr as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_firmware_info_v3_3),
            "::",
            stringify!(mc_baseaddr_low)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).board_i2c_feature_id) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_firmware_info_v3_3),
            "::",
            stringify!(board_i2c_feature_id)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).board_i2c_feature_gpio_id) as usize - ptr as usize },
        49usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_firmware_info_v3_3),
            "::",
            stringify!(board_i2c_feature_gpio_id)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).board_i2c_feature_slave_addr) as usize - ptr as usize
        },
        50usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_firmware_info_v3_3),
            "::",
            stringify!(board_i2c_feature_slave_addr)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).reserved3) as usize - ptr as usize },
        51usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_firmware_info_v3_3),
            "::",
            stringify!(reserved3)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).bootup_mvddq_mv) as usize - ptr as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_firmware_info_v3_3),
            "::",
            stringify!(bootup_mvddq_mv)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).bootup_mvpp_mv) as usize - ptr as usize },
        54usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_firmware_info_v3_3),
            "::",
            stringify!(bootup_mvpp_mv)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).zfbstartaddrin16mb) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_firmware_info_v3_3),
            "::",
            stringify!(zfbstartaddrin16mb)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).pplib_pptable_id) as usize - ptr as usize },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_firmware_info_v3_3),
            "::",
            stringify!(pplib_pptable_id)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).reserved2) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_firmware_info_v3_3),
            "::",
            stringify!(reserved2)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct atom_firmware_info_v3_4 {
    pub table_header: atom_common_table_header,
    pub firmware_revision: u32,
    pub bootup_sclk_in10khz: u32,
    pub bootup_mclk_in10khz: u32,
    pub firmware_capability: u32,
    pub main_call_parser_entry: u32,
    pub bios_scratch_reg_startaddr: u32,
    pub bootup_vddc_mv: u16,
    pub bootup_vddci_mv: u16,
    pub bootup_mvddc_mv: u16,
    pub bootup_vddgfx_mv: u16,
    pub mem_module_id: u8,
    pub coolingsolution_id: u8,
    pub reserved1: [u8; 2usize],
    pub mc_baseaddr_high: u32,
    pub mc_baseaddr_low: u32,
    pub board_i2c_feature_id: u8,
    pub board_i2c_feature_gpio_id: u8,
    pub board_i2c_feature_slave_addr: u8,
    pub ras_rom_i2c_slave_addr: u8,
    pub bootup_mvddq_mv: u16,
    pub bootup_mvpp_mv: u16,
    pub zfbstartaddrin16mb: u32,
    pub pplib_pptable_id: u32,
    pub mvdd_ratio: u32,
    pub hw_bootup_vddgfx_mv: u16,
    pub hw_bootup_vddc_mv: u16,
    pub hw_bootup_mvddc_mv: u16,
    pub hw_bootup_vddci_mv: u16,
    pub maco_pwrlimit_mw: u32,
    pub usb_pwrlimit_mw: u32,
    pub fw_reserved_size_in_kb: u32,
    pub pspbl_init_done_reg_addr: u32,
    pub pspbl_init_done_value: u32,
    pub pspbl_init_done_check_timeout: u32,
    pub reserved: [u32; 2usize],
}
#[test]
fn bindgen_test_layout_atom_firmware_info_v3_4() {
    const UNINIT: ::core::mem::MaybeUninit<atom_firmware_info_v3_4> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<atom_firmware_info_v3_4>(),
        108usize,
        concat!("Size of: ", stringify!(atom_firmware_info_v3_4))
    );
    assert_eq!(
        ::core::mem::align_of::<atom_firmware_info_v3_4>(),
        1usize,
        concat!("Alignment of ", stringify!(atom_firmware_info_v3_4))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).table_header) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_firmware_info_v3_4),
            "::",
            stringify!(table_header)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).firmware_revision) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_firmware_info_v3_4),
            "::",
            stringify!(firmware_revision)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).bootup_sclk_in10khz) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_firmware_info_v3_4),
            "::",
            stringify!(bootup_sclk_in10khz)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).bootup_mclk_in10khz) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_firmware_info_v3_4),
            "::",
            stringify!(bootup_mclk_in10khz)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).firmware_capability) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_firmware_info_v3_4),
            "::",
            stringify!(firmware_capability)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).main_call_parser_entry) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_firmware_info_v3_4),
            "::",
            stringify!(main_call_parser_entry)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).bios_scratch_reg_startaddr) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_firmware_info_v3_4),
            "::",
            stringify!(bios_scratch_reg_startaddr)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).bootup_vddc_mv) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_firmware_info_v3_4),
            "::",
            stringify!(bootup_vddc_mv)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).bootup_vddci_mv) as usize - ptr as usize },
        30usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_firmware_info_v3_4),
            "::",
            stringify!(bootup_vddci_mv)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).bootup_mvddc_mv) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_firmware_info_v3_4),
            "::",
            stringify!(bootup_mvddc_mv)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).bootup_vddgfx_mv) as usize - ptr as usize },
        34usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_firmware_info_v3_4),
            "::",
            stringify!(bootup_vddgfx_mv)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).mem_module_id) as usize - ptr as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_firmware_info_v3_4),
            "::",
            stringify!(mem_module_id)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).coolingsolution_id) as usize - ptr as usize },
        37usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_firmware_info_v3_4),
            "::",
            stringify!(coolingsolution_id)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).reserved1) as usize - ptr as usize },
        38usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_firmware_info_v3_4),
            "::",
            stringify!(reserved1)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).mc_baseaddr_high) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_firmware_info_v3_4),
            "::",
            stringify!(mc_baseaddr_high)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).mc_baseaddr_low) as usize - ptr as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_firmware_info_v3_4),
            "::",
            stringify!(mc_baseaddr_low)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).board_i2c_feature_id) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_firmware_info_v3_4),
            "::",
            stringify!(board_i2c_feature_id)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).board_i2c_feature_gpio_id) as usize - ptr as usize },
        49usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_firmware_info_v3_4),
            "::",
            stringify!(board_i2c_feature_gpio_id)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).board_i2c_feature_slave_addr) as usize - ptr as usize
        },
        50usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_firmware_info_v3_4),
            "::",
            stringify!(board_i2c_feature_slave_addr)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ras_rom_i2c_slave_addr) as usize - ptr as usize },
        51usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_firmware_info_v3_4),
            "::",
            stringify!(ras_rom_i2c_slave_addr)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).bootup_mvddq_mv) as usize - ptr as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_firmware_info_v3_4),
            "::",
            stringify!(bootup_mvddq_mv)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).bootup_mvpp_mv) as usize - ptr as usize },
        54usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_firmware_info_v3_4),
            "::",
            stringify!(bootup_mvpp_mv)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).zfbstartaddrin16mb) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_firmware_info_v3_4),
            "::",
            stringify!(zfbstartaddrin16mb)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).pplib_pptable_id) as usize - ptr as usize },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_firmware_info_v3_4),
            "::",
            stringify!(pplib_pptable_id)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).mvdd_ratio) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_firmware_info_v3_4),
            "::",
            stringify!(mvdd_ratio)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).hw_bootup_vddgfx_mv) as usize - ptr as usize },
        68usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_firmware_info_v3_4),
            "::",
            stringify!(hw_bootup_vddgfx_mv)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).hw_bootup_vddc_mv) as usize - ptr as usize },
        70usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_firmware_info_v3_4),
            "::",
            stringify!(hw_bootup_vddc_mv)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).hw_bootup_mvddc_mv) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_firmware_info_v3_4),
            "::",
            stringify!(hw_bootup_mvddc_mv)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).hw_bootup_vddci_mv) as usize - ptr as usize },
        74usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_firmware_info_v3_4),
            "::",
            stringify!(hw_bootup_vddci_mv)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).maco_pwrlimit_mw) as usize - ptr as usize },
        76usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_firmware_info_v3_4),
            "::",
            stringify!(maco_pwrlimit_mw)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).usb_pwrlimit_mw) as usize - ptr as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_firmware_info_v3_4),
            "::",
            stringify!(usb_pwrlimit_mw)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).fw_reserved_size_in_kb) as usize - ptr as usize },
        84usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_firmware_info_v3_4),
            "::",
            stringify!(fw_reserved_size_in_kb)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).pspbl_init_done_reg_addr) as usize - ptr as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_firmware_info_v3_4),
            "::",
            stringify!(pspbl_init_done_reg_addr)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).pspbl_init_done_value) as usize - ptr as usize },
        92usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_firmware_info_v3_4),
            "::",
            stringify!(pspbl_init_done_value)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).pspbl_init_done_check_timeout) as usize - ptr as usize
        },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_firmware_info_v3_4),
            "::",
            stringify!(pspbl_init_done_check_timeout)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).reserved) as usize - ptr as usize },
        100usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_firmware_info_v3_4),
            "::",
            stringify!(reserved)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct lcd_info_v2_1 {
    pub table_header: atom_common_table_header,
    pub lcd_timing: atom_dtd_format,
    pub backlight_pwm: u16,
    pub special_handle_cap: u16,
    pub panel_misc: u16,
    pub lvds_max_slink_pclk: u16,
    pub lvds_ss_percentage: u16,
    pub lvds_ss_rate_10hz: u16,
    pub pwr_on_digon_to_de: u8,
    pub pwr_on_de_to_vary_bl: u8,
    pub pwr_down_vary_bloff_to_de: u8,
    pub pwr_down_de_to_digoff: u8,
    pub pwr_off_delay: u8,
    pub pwr_on_vary_bl_to_blon: u8,
    pub pwr_down_bloff_to_vary_bloff: u8,
    pub panel_bpc: u8,
    pub dpcd_edp_config_cap: u8,
    pub dpcd_max_link_rate: u8,
    pub dpcd_max_lane_count: u8,
    pub dpcd_max_downspread: u8,
    pub min_allowed_bl_level: u8,
    pub max_allowed_bl_level: u8,
    pub bootup_bl_level: u8,
    pub dplvdsrxid: u8,
    pub reserved1: [u32; 8usize],
}
#[test]
fn bindgen_test_layout_lcd_info_v2_1() {
    const UNINIT: ::core::mem::MaybeUninit<lcd_info_v2_1> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<lcd_info_v2_1>(),
        92usize,
        concat!("Size of: ", stringify!(lcd_info_v2_1))
    );
    assert_eq!(
        ::core::mem::align_of::<lcd_info_v2_1>(),
        1usize,
        concat!("Alignment of ", stringify!(lcd_info_v2_1))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).table_header) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(lcd_info_v2_1),
            "::",
            stringify!(table_header)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).lcd_timing) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(lcd_info_v2_1),
            "::",
            stringify!(lcd_timing)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).backlight_pwm) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(lcd_info_v2_1),
            "::",
            stringify!(backlight_pwm)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).special_handle_cap) as usize - ptr as usize },
        34usize,
        concat!(
            "Offset of field: ",
            stringify!(lcd_info_v2_1),
            "::",
            stringify!(special_handle_cap)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).panel_misc) as usize - ptr as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(lcd_info_v2_1),
            "::",
            stringify!(panel_misc)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).lvds_max_slink_pclk) as usize - ptr as usize },
        38usize,
        concat!(
            "Offset of field: ",
            stringify!(lcd_info_v2_1),
            "::",
            stringify!(lvds_max_slink_pclk)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).lvds_ss_percentage) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(lcd_info_v2_1),
            "::",
            stringify!(lvds_ss_percentage)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).lvds_ss_rate_10hz) as usize - ptr as usize },
        42usize,
        concat!(
            "Offset of field: ",
            stringify!(lcd_info_v2_1),
            "::",
            stringify!(lvds_ss_rate_10hz)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).pwr_on_digon_to_de) as usize - ptr as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(lcd_info_v2_1),
            "::",
            stringify!(pwr_on_digon_to_de)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).pwr_on_de_to_vary_bl) as usize - ptr as usize },
        45usize,
        concat!(
            "Offset of field: ",
            stringify!(lcd_info_v2_1),
            "::",
            stringify!(pwr_on_de_to_vary_bl)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).pwr_down_vary_bloff_to_de) as usize - ptr as usize },
        46usize,
        concat!(
            "Offset of field: ",
            stringify!(lcd_info_v2_1),
            "::",
            stringify!(pwr_down_vary_bloff_to_de)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).pwr_down_de_to_digoff) as usize - ptr as usize },
        47usize,
        concat!(
            "Offset of field: ",
            stringify!(lcd_info_v2_1),
            "::",
            stringify!(pwr_down_de_to_digoff)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).pwr_off_delay) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(lcd_info_v2_1),
            "::",
            stringify!(pwr_off_delay)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).pwr_on_vary_bl_to_blon) as usize - ptr as usize },
        49usize,
        concat!(
            "Offset of field: ",
            stringify!(lcd_info_v2_1),
            "::",
            stringify!(pwr_on_vary_bl_to_blon)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).pwr_down_bloff_to_vary_bloff) as usize - ptr as usize
        },
        50usize,
        concat!(
            "Offset of field: ",
            stringify!(lcd_info_v2_1),
            "::",
            stringify!(pwr_down_bloff_to_vary_bloff)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).panel_bpc) as usize - ptr as usize },
        51usize,
        concat!(
            "Offset of field: ",
            stringify!(lcd_info_v2_1),
            "::",
            stringify!(panel_bpc)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).dpcd_edp_config_cap) as usize - ptr as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(lcd_info_v2_1),
            "::",
            stringify!(dpcd_edp_config_cap)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).dpcd_max_link_rate) as usize - ptr as usize },
        53usize,
        concat!(
            "Offset of field: ",
            stringify!(lcd_info_v2_1),
            "::",
            stringify!(dpcd_max_link_rate)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).dpcd_max_lane_count) as usize - ptr as usize },
        54usize,
        concat!(
            "Offset of field: ",
            stringify!(lcd_info_v2_1),
            "::",
            stringify!(dpcd_max_lane_count)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).dpcd_max_downspread) as usize - ptr as usize },
        55usize,
        concat!(
            "Offset of field: ",
            stringify!(lcd_info_v2_1),
            "::",
            stringify!(dpcd_max_downspread)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).min_allowed_bl_level) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(lcd_info_v2_1),
            "::",
            stringify!(min_allowed_bl_level)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).max_allowed_bl_level) as usize - ptr as usize },
        57usize,
        concat!(
            "Offset of field: ",
            stringify!(lcd_info_v2_1),
            "::",
            stringify!(max_allowed_bl_level)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).bootup_bl_level) as usize - ptr as usize },
        58usize,
        concat!(
            "Offset of field: ",
            stringify!(lcd_info_v2_1),
            "::",
            stringify!(bootup_bl_level)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).dplvdsrxid) as usize - ptr as usize },
        59usize,
        concat!(
            "Offset of field: ",
            stringify!(lcd_info_v2_1),
            "::",
            stringify!(dplvdsrxid)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).reserved1) as usize - ptr as usize },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(lcd_info_v2_1),
            "::",
            stringify!(reserved1)
        )
    );
}
pub const atom_lcd_info_panel_misc_ATOM_PANEL_MISC_FPDI: atom_lcd_info_panel_misc = 2;
pub type atom_lcd_info_panel_misc = ::core::ffi::c_uint;
pub const atom_lcd_info_dptolvds_rx_id_eDP_TO_LVDS_RX_DISABLE: atom_lcd_info_dptolvds_rx_id = 0;
pub const atom_lcd_info_dptolvds_rx_id_eDP_TO_LVDS_COMMON_ID: atom_lcd_info_dptolvds_rx_id = 1;
pub const atom_lcd_info_dptolvds_rx_id_eDP_TO_LVDS_REALTEK_ID: atom_lcd_info_dptolvds_rx_id = 2;
pub type atom_lcd_info_dptolvds_rx_id = ::core::ffi::c_uint;
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct atom_gpio_pin_assignment {
    pub data_a_reg_index: u32,
    pub gpio_bitshift: u8,
    pub gpio_mask_bitshift: u8,
    pub gpio_id: u8,
    pub reserved: u8,
}
#[test]
fn bindgen_test_layout_atom_gpio_pin_assignment() {
    const UNINIT: ::core::mem::MaybeUninit<atom_gpio_pin_assignment> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<atom_gpio_pin_assignment>(),
        8usize,
        concat!("Size of: ", stringify!(atom_gpio_pin_assignment))
    );
    assert_eq!(
        ::core::mem::align_of::<atom_gpio_pin_assignment>(),
        1usize,
        concat!("Alignment of ", stringify!(atom_gpio_pin_assignment))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).data_a_reg_index) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_gpio_pin_assignment),
            "::",
            stringify!(data_a_reg_index)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).gpio_bitshift) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_gpio_pin_assignment),
            "::",
            stringify!(gpio_bitshift)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).gpio_mask_bitshift) as usize - ptr as usize },
        5usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_gpio_pin_assignment),
            "::",
            stringify!(gpio_mask_bitshift)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).gpio_id) as usize - ptr as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_gpio_pin_assignment),
            "::",
            stringify!(gpio_id)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).reserved) as usize - ptr as usize },
        7usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_gpio_pin_assignment),
            "::",
            stringify!(reserved)
        )
    );
}
pub const atom_gpio_pin_assignment_gpio_id_I2C_HW_LANE_MUX: atom_gpio_pin_assignment_gpio_id = 15;
pub const atom_gpio_pin_assignment_gpio_id_I2C_HW_ENGINE_ID_MASK: atom_gpio_pin_assignment_gpio_id =
    112;
pub const atom_gpio_pin_assignment_gpio_id_I2C_HW_CAP: atom_gpio_pin_assignment_gpio_id = 128;
pub const atom_gpio_pin_assignment_gpio_id_PCIE_VDDC_CONTROL_GPIO_PINID:
    atom_gpio_pin_assignment_gpio_id = 56;
pub const atom_gpio_pin_assignment_gpio_id_PP_AC_DC_SWITCH_GPIO_PINID:
    atom_gpio_pin_assignment_gpio_id = 60;
pub const atom_gpio_pin_assignment_gpio_id_VDDC_VRHOT_GPIO_PINID: atom_gpio_pin_assignment_gpio_id =
    61;
pub const atom_gpio_pin_assignment_gpio_id_VDDC_PCC_GPIO_PINID: atom_gpio_pin_assignment_gpio_id =
    62;
pub const atom_gpio_pin_assignment_gpio_id_EFUSE_CUT_ENABLE_GPIO_PINID:
    atom_gpio_pin_assignment_gpio_id = 63;
pub const atom_gpio_pin_assignment_gpio_id_DRAM_SELF_REFRESH_GPIO_PINID:
    atom_gpio_pin_assignment_gpio_id = 64;
pub const atom_gpio_pin_assignment_gpio_id_THERMAL_INT_OUTPUT_GPIO_PINID:
    atom_gpio_pin_assignment_gpio_id = 65;
pub type atom_gpio_pin_assignment_gpio_id = ::core::ffi::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct atom_gpio_pin_lut_v2_1 {
    pub table_header: atom_common_table_header,
    pub gpio_pin: [atom_gpio_pin_assignment; 8usize],
}
#[test]
fn bindgen_test_layout_atom_gpio_pin_lut_v2_1() {
    const UNINIT: ::core::mem::MaybeUninit<atom_gpio_pin_lut_v2_1> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<atom_gpio_pin_lut_v2_1>(),
        68usize,
        concat!("Size of: ", stringify!(atom_gpio_pin_lut_v2_1))
    );
    assert_eq!(
        ::core::mem::align_of::<atom_gpio_pin_lut_v2_1>(),
        1usize,
        concat!("Alignment of ", stringify!(atom_gpio_pin_lut_v2_1))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).table_header) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_gpio_pin_lut_v2_1),
            "::",
            stringify!(table_header)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).gpio_pin) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_gpio_pin_lut_v2_1),
            "::",
            stringify!(gpio_pin)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct vram_usagebyfirmware_v2_1 {
    pub table_header: atom_common_table_header,
    pub start_address_in_kb: u32,
    pub used_by_firmware_in_kb: u16,
    pub used_by_driver_in_kb: u16,
}
#[test]
fn bindgen_test_layout_vram_usagebyfirmware_v2_1() {
    const UNINIT: ::core::mem::MaybeUninit<vram_usagebyfirmware_v2_1> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<vram_usagebyfirmware_v2_1>(),
        12usize,
        concat!("Size of: ", stringify!(vram_usagebyfirmware_v2_1))
    );
    assert_eq!(
        ::core::mem::align_of::<vram_usagebyfirmware_v2_1>(),
        1usize,
        concat!("Alignment of ", stringify!(vram_usagebyfirmware_v2_1))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).table_header) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(vram_usagebyfirmware_v2_1),
            "::",
            stringify!(table_header)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).start_address_in_kb) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(vram_usagebyfirmware_v2_1),
            "::",
            stringify!(start_address_in_kb)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).used_by_firmware_in_kb) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(vram_usagebyfirmware_v2_1),
            "::",
            stringify!(used_by_firmware_in_kb)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).used_by_driver_in_kb) as usize - ptr as usize },
        10usize,
        concat!(
            "Offset of field: ",
            stringify!(vram_usagebyfirmware_v2_1),
            "::",
            stringify!(used_by_driver_in_kb)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct vram_usagebyfirmware_v2_2 {
    pub table_header: atom_common_table_header,
    pub fw_region_start_address_in_kb: u32,
    pub used_by_firmware_in_kb: u16,
    pub reserved: u16,
    pub driver_region0_start_address_in_kb: u32,
    pub used_by_driver_region0_in_kb: u32,
    pub reserved32: [u32; 7usize],
}
#[test]
fn bindgen_test_layout_vram_usagebyfirmware_v2_2() {
    const UNINIT: ::core::mem::MaybeUninit<vram_usagebyfirmware_v2_2> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<vram_usagebyfirmware_v2_2>(),
        48usize,
        concat!("Size of: ", stringify!(vram_usagebyfirmware_v2_2))
    );
    assert_eq!(
        ::core::mem::align_of::<vram_usagebyfirmware_v2_2>(),
        1usize,
        concat!("Alignment of ", stringify!(vram_usagebyfirmware_v2_2))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).table_header) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(vram_usagebyfirmware_v2_2),
            "::",
            stringify!(table_header)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).fw_region_start_address_in_kb) as usize - ptr as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(vram_usagebyfirmware_v2_2),
            "::",
            stringify!(fw_region_start_address_in_kb)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).used_by_firmware_in_kb) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(vram_usagebyfirmware_v2_2),
            "::",
            stringify!(used_by_firmware_in_kb)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).reserved) as usize - ptr as usize },
        10usize,
        concat!(
            "Offset of field: ",
            stringify!(vram_usagebyfirmware_v2_2),
            "::",
            stringify!(reserved)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).driver_region0_start_address_in_kb) as usize - ptr as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(vram_usagebyfirmware_v2_2),
            "::",
            stringify!(driver_region0_start_address_in_kb)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).used_by_driver_region0_in_kb) as usize - ptr as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(vram_usagebyfirmware_v2_2),
            "::",
            stringify!(used_by_driver_region0_in_kb)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).reserved32) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(vram_usagebyfirmware_v2_2),
            "::",
            stringify!(reserved32)
        )
    );
}
pub const atom_object_record_type_id_ATOM_I2C_RECORD_TYPE: atom_object_record_type_id = 1;
pub const atom_object_record_type_id_ATOM_HPD_INT_RECORD_TYPE: atom_object_record_type_id = 2;
pub const atom_object_record_type_id_ATOM_CONNECTOR_CAP_RECORD_TYPE: atom_object_record_type_id = 3;
pub const atom_object_record_type_id_ATOM_CONNECTOR_SPEED_UPTO: atom_object_record_type_id = 4;
pub const atom_object_record_type_id_ATOM_OBJECT_GPIO_CNTL_RECORD_TYPE: atom_object_record_type_id =
    9;
pub const atom_object_record_type_id_ATOM_CONNECTOR_HPDPIN_LUT_RECORD_TYPE:
    atom_object_record_type_id = 16;
pub const atom_object_record_type_id_ATOM_CONNECTOR_AUXDDC_LUT_RECORD_TYPE:
    atom_object_record_type_id = 17;
pub const atom_object_record_type_id_ATOM_ENCODER_CAP_RECORD_TYPE: atom_object_record_type_id = 20;
pub const atom_object_record_type_id_ATOM_BRACKET_LAYOUT_RECORD_TYPE: atom_object_record_type_id =
    21;
pub const atom_object_record_type_id_ATOM_CONNECTOR_FORCED_TMDS_CAP_RECORD_TYPE:
    atom_object_record_type_id = 22;
pub const atom_object_record_type_id_ATOM_DISP_CONNECTOR_CAPS_RECORD_TYPE:
    atom_object_record_type_id = 23;
pub const atom_object_record_type_id_ATOM_BRACKET_LAYOUT_V2_RECORD_TYPE:
    atom_object_record_type_id = 25;
pub const atom_object_record_type_id_ATOM_RECORD_END_TYPE: atom_object_record_type_id = 255;
pub type atom_object_record_type_id = ::core::ffi::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct atom_common_record_header {
    pub record_type: u8,
    pub record_size: u8,
}
#[test]
fn bindgen_test_layout_atom_common_record_header() {
    const UNINIT: ::core::mem::MaybeUninit<atom_common_record_header> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<atom_common_record_header>(),
        2usize,
        concat!("Size of: ", stringify!(atom_common_record_header))
    );
    assert_eq!(
        ::core::mem::align_of::<atom_common_record_header>(),
        1usize,
        concat!("Alignment of ", stringify!(atom_common_record_header))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).record_type) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_common_record_header),
            "::",
            stringify!(record_type)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).record_size) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_common_record_header),
            "::",
            stringify!(record_size)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct atom_i2c_record {
    pub record_header: atom_common_record_header,
    pub i2c_id: u8,
    pub i2c_slave_addr: u8,
}
#[test]
fn bindgen_test_layout_atom_i2c_record() {
    const UNINIT: ::core::mem::MaybeUninit<atom_i2c_record> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<atom_i2c_record>(),
        4usize,
        concat!("Size of: ", stringify!(atom_i2c_record))
    );
    assert_eq!(
        ::core::mem::align_of::<atom_i2c_record>(),
        1usize,
        concat!("Alignment of ", stringify!(atom_i2c_record))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).record_header) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_i2c_record),
            "::",
            stringify!(record_header)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).i2c_id) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_i2c_record),
            "::",
            stringify!(i2c_id)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).i2c_slave_addr) as usize - ptr as usize },
        3usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_i2c_record),
            "::",
            stringify!(i2c_slave_addr)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct atom_hpd_int_record {
    pub record_header: atom_common_record_header,
    pub pin_id: u8,
    pub plugin_pin_state: u8,
}
#[test]
fn bindgen_test_layout_atom_hpd_int_record() {
    const UNINIT: ::core::mem::MaybeUninit<atom_hpd_int_record> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<atom_hpd_int_record>(),
        4usize,
        concat!("Size of: ", stringify!(atom_hpd_int_record))
    );
    assert_eq!(
        ::core::mem::align_of::<atom_hpd_int_record>(),
        1usize,
        concat!("Alignment of ", stringify!(atom_hpd_int_record))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).record_header) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_hpd_int_record),
            "::",
            stringify!(record_header)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).pin_id) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_hpd_int_record),
            "::",
            stringify!(pin_id)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).plugin_pin_state) as usize - ptr as usize },
        3usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_hpd_int_record),
            "::",
            stringify!(plugin_pin_state)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct atom_connector_caps_record {
    pub record_header: atom_common_record_header,
    pub connector_caps: u16,
}
#[test]
fn bindgen_test_layout_atom_connector_caps_record() {
    const UNINIT: ::core::mem::MaybeUninit<atom_connector_caps_record> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<atom_connector_caps_record>(),
        4usize,
        concat!("Size of: ", stringify!(atom_connector_caps_record))
    );
    assert_eq!(
        ::core::mem::align_of::<atom_connector_caps_record>(),
        1usize,
        concat!("Alignment of ", stringify!(atom_connector_caps_record))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).record_header) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_connector_caps_record),
            "::",
            stringify!(record_header)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).connector_caps) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_connector_caps_record),
            "::",
            stringify!(connector_caps)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct atom_connector_speed_record {
    pub record_header: atom_common_record_header,
    pub connector_max_speed: u32,
    pub reserved: u16,
}
#[test]
fn bindgen_test_layout_atom_connector_speed_record() {
    const UNINIT: ::core::mem::MaybeUninit<atom_connector_speed_record> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<atom_connector_speed_record>(),
        8usize,
        concat!("Size of: ", stringify!(atom_connector_speed_record))
    );
    assert_eq!(
        ::core::mem::align_of::<atom_connector_speed_record>(),
        1usize,
        concat!("Alignment of ", stringify!(atom_connector_speed_record))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).record_header) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_connector_speed_record),
            "::",
            stringify!(record_header)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).connector_max_speed) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_connector_speed_record),
            "::",
            stringify!(connector_max_speed)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).reserved) as usize - ptr as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_connector_speed_record),
            "::",
            stringify!(reserved)
        )
    );
}
pub const atom_encoder_caps_def_ATOM_ENCODER_CAP_RECORD_HBR2: atom_encoder_caps_def = 1;
pub const atom_encoder_caps_def_ATOM_ENCODER_CAP_RECORD_MST_EN: atom_encoder_caps_def = 1;
pub const atom_encoder_caps_def_ATOM_ENCODER_CAP_RECORD_HBR2_EN: atom_encoder_caps_def = 2;
pub const atom_encoder_caps_def_ATOM_ENCODER_CAP_RECORD_HDMI6Gbps_EN: atom_encoder_caps_def = 4;
pub const atom_encoder_caps_def_ATOM_ENCODER_CAP_RECORD_HBR3_EN: atom_encoder_caps_def = 8;
pub const atom_encoder_caps_def_ATOM_ENCODER_CAP_RECORD_DP2: atom_encoder_caps_def = 16;
pub const atom_encoder_caps_def_ATOM_ENCODER_CAP_RECORD_UHBR10_EN: atom_encoder_caps_def = 32;
pub const atom_encoder_caps_def_ATOM_ENCODER_CAP_RECORD_UHBR13_5_EN: atom_encoder_caps_def = 64;
pub const atom_encoder_caps_def_ATOM_ENCODER_CAP_RECORD_UHBR20_EN: atom_encoder_caps_def = 128;
pub const atom_encoder_caps_def_ATOM_ENCODER_CAP_RECORD_USB_C_TYPE: atom_encoder_caps_def = 256;
pub type atom_encoder_caps_def = ::core::ffi::c_uint;
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct atom_encoder_caps_record {
    pub record_header: atom_common_record_header,
    pub encodercaps: u32,
}
#[test]
fn bindgen_test_layout_atom_encoder_caps_record() {
    const UNINIT: ::core::mem::MaybeUninit<atom_encoder_caps_record> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<atom_encoder_caps_record>(),
        6usize,
        concat!("Size of: ", stringify!(atom_encoder_caps_record))
    );
    assert_eq!(
        ::core::mem::align_of::<atom_encoder_caps_record>(),
        1usize,
        concat!("Alignment of ", stringify!(atom_encoder_caps_record))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).record_header) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_encoder_caps_record),
            "::",
            stringify!(record_header)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).encodercaps) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_encoder_caps_record),
            "::",
            stringify!(encodercaps)
        )
    );
}
pub const atom_connector_caps_def_ATOM_CONNECTOR_CAP_INTERNAL_DISPLAY: atom_connector_caps_def = 1;
pub const atom_connector_caps_def_ATOM_CONNECTOR_CAP_INTERNAL_DISPLAY_BL: atom_connector_caps_def =
    2;
pub type atom_connector_caps_def = ::core::ffi::c_uint;
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct atom_disp_connector_caps_record {
    pub record_header: atom_common_record_header,
    pub connectcaps: u32,
}
#[test]
fn bindgen_test_layout_atom_disp_connector_caps_record() {
    const UNINIT: ::core::mem::MaybeUninit<atom_disp_connector_caps_record> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<atom_disp_connector_caps_record>(),
        6usize,
        concat!("Size of: ", stringify!(atom_disp_connector_caps_record))
    );
    assert_eq!(
        ::core::mem::align_of::<atom_disp_connector_caps_record>(),
        1usize,
        concat!("Alignment of ", stringify!(atom_disp_connector_caps_record))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).record_header) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_disp_connector_caps_record),
            "::",
            stringify!(record_header)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).connectcaps) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_disp_connector_caps_record),
            "::",
            stringify!(connectcaps)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct atom_gpio_pin_control_pair {
    pub gpio_id: u8,
    pub gpio_pinstate: u8,
}
#[test]
fn bindgen_test_layout_atom_gpio_pin_control_pair() {
    const UNINIT: ::core::mem::MaybeUninit<atom_gpio_pin_control_pair> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<atom_gpio_pin_control_pair>(),
        2usize,
        concat!("Size of: ", stringify!(atom_gpio_pin_control_pair))
    );
    assert_eq!(
        ::core::mem::align_of::<atom_gpio_pin_control_pair>(),
        1usize,
        concat!("Alignment of ", stringify!(atom_gpio_pin_control_pair))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).gpio_id) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_gpio_pin_control_pair),
            "::",
            stringify!(gpio_id)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).gpio_pinstate) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_gpio_pin_control_pair),
            "::",
            stringify!(gpio_pinstate)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct atom_object_gpio_cntl_record {
    pub record_header: atom_common_record_header,
    pub flag: u8,
    pub number_of_pins: u8,
    pub gpio: [atom_gpio_pin_control_pair; 1usize],
}
#[test]
fn bindgen_test_layout_atom_object_gpio_cntl_record() {
    const UNINIT: ::core::mem::MaybeUninit<atom_object_gpio_cntl_record> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<atom_object_gpio_cntl_record>(),
        6usize,
        concat!("Size of: ", stringify!(atom_object_gpio_cntl_record))
    );
    assert_eq!(
        ::core::mem::align_of::<atom_object_gpio_cntl_record>(),
        1usize,
        concat!("Alignment of ", stringify!(atom_object_gpio_cntl_record))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).record_header) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_object_gpio_cntl_record),
            "::",
            stringify!(record_header)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).flag) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_object_gpio_cntl_record),
            "::",
            stringify!(flag)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).number_of_pins) as usize - ptr as usize },
        3usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_object_gpio_cntl_record),
            "::",
            stringify!(number_of_pins)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).gpio) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_object_gpio_cntl_record),
            "::",
            stringify!(gpio)
        )
    );
}
pub const atom_gpio_pin_control_pinstate_def_GPIO_PIN_TYPE_INPUT:
    atom_gpio_pin_control_pinstate_def = 0;
pub const atom_gpio_pin_control_pinstate_def_GPIO_PIN_TYPE_OUTPUT:
    atom_gpio_pin_control_pinstate_def = 16;
pub const atom_gpio_pin_control_pinstate_def_GPIO_PIN_TYPE_HW_CONTROL:
    atom_gpio_pin_control_pinstate_def = 32;
pub const atom_gpio_pin_control_pinstate_def_GPIO_PIN_OUTPUT_STATE_MASK:
    atom_gpio_pin_control_pinstate_def = 1;
pub const atom_gpio_pin_control_pinstate_def_GPIO_PIN_OUTPUT_STATE_SHIFT:
    atom_gpio_pin_control_pinstate_def = 0;
pub const atom_gpio_pin_control_pinstate_def_GPIO_PIN_STATE_ACTIVE_LOW:
    atom_gpio_pin_control_pinstate_def = 0;
pub const atom_gpio_pin_control_pinstate_def_GPIO_PIN_STATE_ACTIVE_HIGH:
    atom_gpio_pin_control_pinstate_def = 1;
pub type atom_gpio_pin_control_pinstate_def = ::core::ffi::c_uint;
pub const atom_glsync_record_gpio_index_def_ATOM_GPIO_INDEX_GLSYNC_REFCLK:
    atom_glsync_record_gpio_index_def = 0;
pub const atom_glsync_record_gpio_index_def_ATOM_GPIO_INDEX_GLSYNC_HSYNC:
    atom_glsync_record_gpio_index_def = 1;
pub const atom_glsync_record_gpio_index_def_ATOM_GPIO_INDEX_GLSYNC_VSYNC:
    atom_glsync_record_gpio_index_def = 2;
pub const atom_glsync_record_gpio_index_def_ATOM_GPIO_INDEX_GLSYNC_SWAP_REQ:
    atom_glsync_record_gpio_index_def = 3;
pub const atom_glsync_record_gpio_index_def_ATOM_GPIO_INDEX_GLSYNC_SWAP_GNT:
    atom_glsync_record_gpio_index_def = 4;
pub const atom_glsync_record_gpio_index_def_ATOM_GPIO_INDEX_GLSYNC_INTERRUPT:
    atom_glsync_record_gpio_index_def = 5;
pub const atom_glsync_record_gpio_index_def_ATOM_GPIO_INDEX_GLSYNC_V_RESET:
    atom_glsync_record_gpio_index_def = 6;
pub const atom_glsync_record_gpio_index_def_ATOM_GPIO_INDEX_GLSYNC_SWAP_CNTL:
    atom_glsync_record_gpio_index_def = 7;
pub const atom_glsync_record_gpio_index_def_ATOM_GPIO_INDEX_GLSYNC_SWAP_SEL:
    atom_glsync_record_gpio_index_def = 8;
pub const atom_glsync_record_gpio_index_def_ATOM_GPIO_INDEX_GLSYNC_MAX:
    atom_glsync_record_gpio_index_def = 9;
pub type atom_glsync_record_gpio_index_def = ::core::ffi::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct atom_connector_hpdpin_lut_record {
    pub record_header: atom_common_record_header,
    pub hpd_pin_map: [u8; 8usize],
}
#[test]
fn bindgen_test_layout_atom_connector_hpdpin_lut_record() {
    const UNINIT: ::core::mem::MaybeUninit<atom_connector_hpdpin_lut_record> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<atom_connector_hpdpin_lut_record>(),
        10usize,
        concat!("Size of: ", stringify!(atom_connector_hpdpin_lut_record))
    );
    assert_eq!(
        ::core::mem::align_of::<atom_connector_hpdpin_lut_record>(),
        1usize,
        concat!(
            "Alignment of ",
            stringify!(atom_connector_hpdpin_lut_record)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).record_header) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_connector_hpdpin_lut_record),
            "::",
            stringify!(record_header)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).hpd_pin_map) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_connector_hpdpin_lut_record),
            "::",
            stringify!(hpd_pin_map)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct atom_connector_auxddc_lut_record {
    pub record_header: atom_common_record_header,
    pub aux_ddc_map: [u8; 8usize],
}
#[test]
fn bindgen_test_layout_atom_connector_auxddc_lut_record() {
    const UNINIT: ::core::mem::MaybeUninit<atom_connector_auxddc_lut_record> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<atom_connector_auxddc_lut_record>(),
        10usize,
        concat!("Size of: ", stringify!(atom_connector_auxddc_lut_record))
    );
    assert_eq!(
        ::core::mem::align_of::<atom_connector_auxddc_lut_record>(),
        1usize,
        concat!(
            "Alignment of ",
            stringify!(atom_connector_auxddc_lut_record)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).record_header) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_connector_auxddc_lut_record),
            "::",
            stringify!(record_header)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).aux_ddc_map) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_connector_auxddc_lut_record),
            "::",
            stringify!(aux_ddc_map)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct atom_connector_forced_tmds_cap_record {
    pub record_header: atom_common_record_header,
    pub maxtmdsclkrate_in2_5mhz: u8,
    pub reserved: u8,
}
#[test]
fn bindgen_test_layout_atom_connector_forced_tmds_cap_record() {
    const UNINIT: ::core::mem::MaybeUninit<atom_connector_forced_tmds_cap_record> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<atom_connector_forced_tmds_cap_record>(),
        4usize,
        concat!(
            "Size of: ",
            stringify!(atom_connector_forced_tmds_cap_record)
        )
    );
    assert_eq!(
        ::core::mem::align_of::<atom_connector_forced_tmds_cap_record>(),
        1usize,
        concat!(
            "Alignment of ",
            stringify!(atom_connector_forced_tmds_cap_record)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).record_header) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_connector_forced_tmds_cap_record),
            "::",
            stringify!(record_header)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).maxtmdsclkrate_in2_5mhz) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_connector_forced_tmds_cap_record),
            "::",
            stringify!(maxtmdsclkrate_in2_5mhz)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).reserved) as usize - ptr as usize },
        3usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_connector_forced_tmds_cap_record),
            "::",
            stringify!(reserved)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct atom_connector_layout_info {
    pub connectorobjid: u16,
    pub connector_type: u8,
    pub position: u8,
}
#[test]
fn bindgen_test_layout_atom_connector_layout_info() {
    const UNINIT: ::core::mem::MaybeUninit<atom_connector_layout_info> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<atom_connector_layout_info>(),
        4usize,
        concat!("Size of: ", stringify!(atom_connector_layout_info))
    );
    assert_eq!(
        ::core::mem::align_of::<atom_connector_layout_info>(),
        1usize,
        concat!("Alignment of ", stringify!(atom_connector_layout_info))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).connectorobjid) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_connector_layout_info),
            "::",
            stringify!(connectorobjid)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).connector_type) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_connector_layout_info),
            "::",
            stringify!(connector_type)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).position) as usize - ptr as usize },
        3usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_connector_layout_info),
            "::",
            stringify!(position)
        )
    );
}
pub const atom_connector_layout_info_connector_type_def_CONNECTOR_TYPE_DVI_D:
    atom_connector_layout_info_connector_type_def = 1;
pub const atom_connector_layout_info_connector_type_def_CONNECTOR_TYPE_HDMI:
    atom_connector_layout_info_connector_type_def = 4;
pub const atom_connector_layout_info_connector_type_def_CONNECTOR_TYPE_DISPLAY_PORT:
    atom_connector_layout_info_connector_type_def = 5;
pub const atom_connector_layout_info_connector_type_def_CONNECTOR_TYPE_MINI_DISPLAY_PORT:
    atom_connector_layout_info_connector_type_def = 6;
pub type atom_connector_layout_info_connector_type_def = ::core::ffi::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct atom_bracket_layout_record {
    pub record_header: atom_common_record_header,
    pub bracketlen: u8,
    pub bracketwidth: u8,
    pub conn_num: u8,
    pub reserved: u8,
    pub conn_info: [atom_connector_layout_info; 1usize],
}
#[test]
fn bindgen_test_layout_atom_bracket_layout_record() {
    const UNINIT: ::core::mem::MaybeUninit<atom_bracket_layout_record> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<atom_bracket_layout_record>(),
        10usize,
        concat!("Size of: ", stringify!(atom_bracket_layout_record))
    );
    assert_eq!(
        ::core::mem::align_of::<atom_bracket_layout_record>(),
        1usize,
        concat!("Alignment of ", stringify!(atom_bracket_layout_record))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).record_header) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_bracket_layout_record),
            "::",
            stringify!(record_header)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).bracketlen) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_bracket_layout_record),
            "::",
            stringify!(bracketlen)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).bracketwidth) as usize - ptr as usize },
        3usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_bracket_layout_record),
            "::",
            stringify!(bracketwidth)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).conn_num) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_bracket_layout_record),
            "::",
            stringify!(conn_num)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).reserved) as usize - ptr as usize },
        5usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_bracket_layout_record),
            "::",
            stringify!(reserved)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).conn_info) as usize - ptr as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_bracket_layout_record),
            "::",
            stringify!(conn_info)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct atom_bracket_layout_record_v2 {
    pub record_header: atom_common_record_header,
    pub bracketlen: u8,
    pub bracketwidth: u8,
    pub conn_num: u8,
    pub mini_type: u8,
    pub reserved1: u8,
    pub reserved2: u8,
}
#[test]
fn bindgen_test_layout_atom_bracket_layout_record_v2() {
    const UNINIT: ::core::mem::MaybeUninit<atom_bracket_layout_record_v2> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<atom_bracket_layout_record_v2>(),
        8usize,
        concat!("Size of: ", stringify!(atom_bracket_layout_record_v2))
    );
    assert_eq!(
        ::core::mem::align_of::<atom_bracket_layout_record_v2>(),
        1usize,
        concat!("Alignment of ", stringify!(atom_bracket_layout_record_v2))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).record_header) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_bracket_layout_record_v2),
            "::",
            stringify!(record_header)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).bracketlen) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_bracket_layout_record_v2),
            "::",
            stringify!(bracketlen)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).bracketwidth) as usize - ptr as usize },
        3usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_bracket_layout_record_v2),
            "::",
            stringify!(bracketwidth)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).conn_num) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_bracket_layout_record_v2),
            "::",
            stringify!(conn_num)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).mini_type) as usize - ptr as usize },
        5usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_bracket_layout_record_v2),
            "::",
            stringify!(mini_type)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).reserved1) as usize - ptr as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_bracket_layout_record_v2),
            "::",
            stringify!(reserved1)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).reserved2) as usize - ptr as usize },
        7usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_bracket_layout_record_v2),
            "::",
            stringify!(reserved2)
        )
    );
}
pub const atom_connector_layout_info_mini_type_def_MINI_TYPE_NORMAL:
    atom_connector_layout_info_mini_type_def = 0;
pub const atom_connector_layout_info_mini_type_def_MINI_TYPE_MINI:
    atom_connector_layout_info_mini_type_def = 1;
pub type atom_connector_layout_info_mini_type_def = ::core::ffi::c_uint;
pub const atom_display_device_tag_def_ATOM_DISPLAY_LCD1_SUPPORT: atom_display_device_tag_def = 2;
pub const atom_display_device_tag_def_ATOM_DISPLAY_LCD2_SUPPORT: atom_display_device_tag_def = 32;
pub const atom_display_device_tag_def_ATOM_DISPLAY_DFP1_SUPPORT: atom_display_device_tag_def = 8;
pub const atom_display_device_tag_def_ATOM_DISPLAY_DFP2_SUPPORT: atom_display_device_tag_def = 128;
pub const atom_display_device_tag_def_ATOM_DISPLAY_DFP3_SUPPORT: atom_display_device_tag_def = 512;
pub const atom_display_device_tag_def_ATOM_DISPLAY_DFP4_SUPPORT: atom_display_device_tag_def = 1024;
pub const atom_display_device_tag_def_ATOM_DISPLAY_DFP5_SUPPORT: atom_display_device_tag_def = 2048;
pub const atom_display_device_tag_def_ATOM_DISPLAY_DFP6_SUPPORT: atom_display_device_tag_def = 64;
pub const atom_display_device_tag_def_ATOM_DISPLAY_DFPx_SUPPORT: atom_display_device_tag_def = 3784;
pub type atom_display_device_tag_def = ::core::ffi::c_uint;
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct atom_display_object_path_v2 {
    pub display_objid: u16,
    pub disp_recordoffset: u16,
    pub encoderobjid: u16,
    pub extencoderobjid: u16,
    pub encoder_recordoffset: u16,
    pub extencoder_recordoffset: u16,
    pub device_tag: u16,
    pub priority_id: u8,
    pub reserved: u8,
}
#[test]
fn bindgen_test_layout_atom_display_object_path_v2() {
    const UNINIT: ::core::mem::MaybeUninit<atom_display_object_path_v2> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<atom_display_object_path_v2>(),
        16usize,
        concat!("Size of: ", stringify!(atom_display_object_path_v2))
    );
    assert_eq!(
        ::core::mem::align_of::<atom_display_object_path_v2>(),
        1usize,
        concat!("Alignment of ", stringify!(atom_display_object_path_v2))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).display_objid) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_display_object_path_v2),
            "::",
            stringify!(display_objid)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).disp_recordoffset) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_display_object_path_v2),
            "::",
            stringify!(disp_recordoffset)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).encoderobjid) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_display_object_path_v2),
            "::",
            stringify!(encoderobjid)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).extencoderobjid) as usize - ptr as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_display_object_path_v2),
            "::",
            stringify!(extencoderobjid)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).encoder_recordoffset) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_display_object_path_v2),
            "::",
            stringify!(encoder_recordoffset)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).extencoder_recordoffset) as usize - ptr as usize },
        10usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_display_object_path_v2),
            "::",
            stringify!(extencoder_recordoffset)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).device_tag) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_display_object_path_v2),
            "::",
            stringify!(device_tag)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).priority_id) as usize - ptr as usize },
        14usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_display_object_path_v2),
            "::",
            stringify!(priority_id)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).reserved) as usize - ptr as usize },
        15usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_display_object_path_v2),
            "::",
            stringify!(reserved)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct atom_display_object_path_v3 {
    pub display_objid: u16,
    pub disp_recordoffset: u16,
    pub encoderobjid: u16,
    pub reserved1: u16,
    pub reserved2: u16,
    pub reserved3: u16,
    pub device_tag: u16,
    pub reserved4: u16,
}
#[test]
fn bindgen_test_layout_atom_display_object_path_v3() {
    const UNINIT: ::core::mem::MaybeUninit<atom_display_object_path_v3> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<atom_display_object_path_v3>(),
        16usize,
        concat!("Size of: ", stringify!(atom_display_object_path_v3))
    );
    assert_eq!(
        ::core::mem::align_of::<atom_display_object_path_v3>(),
        1usize,
        concat!("Alignment of ", stringify!(atom_display_object_path_v3))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).display_objid) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_display_object_path_v3),
            "::",
            stringify!(display_objid)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).disp_recordoffset) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_display_object_path_v3),
            "::",
            stringify!(disp_recordoffset)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).encoderobjid) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_display_object_path_v3),
            "::",
            stringify!(encoderobjid)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).reserved1) as usize - ptr as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_display_object_path_v3),
            "::",
            stringify!(reserved1)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).reserved2) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_display_object_path_v3),
            "::",
            stringify!(reserved2)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).reserved3) as usize - ptr as usize },
        10usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_display_object_path_v3),
            "::",
            stringify!(reserved3)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).device_tag) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_display_object_path_v3),
            "::",
            stringify!(device_tag)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).reserved4) as usize - ptr as usize },
        14usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_display_object_path_v3),
            "::",
            stringify!(reserved4)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct display_object_info_table_v1_4 {
    pub table_header: atom_common_table_header,
    pub supporteddevices: u16,
    pub number_of_path: u8,
    pub reserved: u8,
    pub display_path: [atom_display_object_path_v2; 8usize],
}
#[test]
fn bindgen_test_layout_display_object_info_table_v1_4() {
    const UNINIT: ::core::mem::MaybeUninit<display_object_info_table_v1_4> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<display_object_info_table_v1_4>(),
        136usize,
        concat!("Size of: ", stringify!(display_object_info_table_v1_4))
    );
    assert_eq!(
        ::core::mem::align_of::<display_object_info_table_v1_4>(),
        1usize,
        concat!("Alignment of ", stringify!(display_object_info_table_v1_4))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).table_header) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(display_object_info_table_v1_4),
            "::",
            stringify!(table_header)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).supporteddevices) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(display_object_info_table_v1_4),
            "::",
            stringify!(supporteddevices)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).number_of_path) as usize - ptr as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(display_object_info_table_v1_4),
            "::",
            stringify!(number_of_path)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).reserved) as usize - ptr as usize },
        7usize,
        concat!(
            "Offset of field: ",
            stringify!(display_object_info_table_v1_4),
            "::",
            stringify!(reserved)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).display_path) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(display_object_info_table_v1_4),
            "::",
            stringify!(display_path)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct display_object_info_table_v1_5 {
    pub table_header: atom_common_table_header,
    pub supporteddevices: u16,
    pub number_of_path: u8,
    pub reserved: u8,
    pub display_path: [atom_display_object_path_v3; 8usize],
}
#[test]
fn bindgen_test_layout_display_object_info_table_v1_5() {
    const UNINIT: ::core::mem::MaybeUninit<display_object_info_table_v1_5> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<display_object_info_table_v1_5>(),
        136usize,
        concat!("Size of: ", stringify!(display_object_info_table_v1_5))
    );
    assert_eq!(
        ::core::mem::align_of::<display_object_info_table_v1_5>(),
        1usize,
        concat!("Alignment of ", stringify!(display_object_info_table_v1_5))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).table_header) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(display_object_info_table_v1_5),
            "::",
            stringify!(table_header)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).supporteddevices) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(display_object_info_table_v1_5),
            "::",
            stringify!(supporteddevices)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).number_of_path) as usize - ptr as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(display_object_info_table_v1_5),
            "::",
            stringify!(number_of_path)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).reserved) as usize - ptr as usize },
        7usize,
        concat!(
            "Offset of field: ",
            stringify!(display_object_info_table_v1_5),
            "::",
            stringify!(reserved)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).display_path) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(display_object_info_table_v1_5),
            "::",
            stringify!(display_path)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct atom_display_controller_info_v4_1 {
    pub table_header: atom_common_table_header,
    pub display_caps: u32,
    pub bootup_dispclk_10khz: u32,
    pub dce_refclk_10khz: u16,
    pub i2c_engine_refclk_10khz: u16,
    pub dvi_ss_percentage: u16,
    pub dvi_ss_rate_10hz: u16,
    pub hdmi_ss_percentage: u16,
    pub hdmi_ss_rate_10hz: u16,
    pub dp_ss_percentage: u16,
    pub dp_ss_rate_10hz: u16,
    pub dvi_ss_mode: u8,
    pub hdmi_ss_mode: u8,
    pub dp_ss_mode: u8,
    pub ss_reserved: u8,
    pub hardcode_mode_num: u8,
    pub reserved1: [u8; 3usize],
    pub dpphy_refclk_10khz: u16,
    pub reserved2: u16,
    pub dceip_min_ver: u8,
    pub dceip_max_ver: u8,
    pub max_disp_pipe_num: u8,
    pub max_vbios_active_disp_pipe_num: u8,
    pub max_ppll_num: u8,
    pub max_disp_phy_num: u8,
    pub max_aux_pairs: u8,
    pub remotedisplayconfig: u8,
    pub reserved3: [u8; 8usize],
}
#[test]
fn bindgen_test_layout_atom_display_controller_info_v4_1() {
    const UNINIT: ::core::mem::MaybeUninit<atom_display_controller_info_v4_1> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<atom_display_controller_info_v4_1>(),
        56usize,
        concat!("Size of: ", stringify!(atom_display_controller_info_v4_1))
    );
    assert_eq!(
        ::core::mem::align_of::<atom_display_controller_info_v4_1>(),
        1usize,
        concat!(
            "Alignment of ",
            stringify!(atom_display_controller_info_v4_1)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).table_header) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_display_controller_info_v4_1),
            "::",
            stringify!(table_header)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).display_caps) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_display_controller_info_v4_1),
            "::",
            stringify!(display_caps)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).bootup_dispclk_10khz) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_display_controller_info_v4_1),
            "::",
            stringify!(bootup_dispclk_10khz)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).dce_refclk_10khz) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_display_controller_info_v4_1),
            "::",
            stringify!(dce_refclk_10khz)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).i2c_engine_refclk_10khz) as usize - ptr as usize },
        14usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_display_controller_info_v4_1),
            "::",
            stringify!(i2c_engine_refclk_10khz)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).dvi_ss_percentage) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_display_controller_info_v4_1),
            "::",
            stringify!(dvi_ss_percentage)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).dvi_ss_rate_10hz) as usize - ptr as usize },
        18usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_display_controller_info_v4_1),
            "::",
            stringify!(dvi_ss_rate_10hz)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).hdmi_ss_percentage) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_display_controller_info_v4_1),
            "::",
            stringify!(hdmi_ss_percentage)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).hdmi_ss_rate_10hz) as usize - ptr as usize },
        22usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_display_controller_info_v4_1),
            "::",
            stringify!(hdmi_ss_rate_10hz)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).dp_ss_percentage) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_display_controller_info_v4_1),
            "::",
            stringify!(dp_ss_percentage)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).dp_ss_rate_10hz) as usize - ptr as usize },
        26usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_display_controller_info_v4_1),
            "::",
            stringify!(dp_ss_rate_10hz)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).dvi_ss_mode) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_display_controller_info_v4_1),
            "::",
            stringify!(dvi_ss_mode)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).hdmi_ss_mode) as usize - ptr as usize },
        29usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_display_controller_info_v4_1),
            "::",
            stringify!(hdmi_ss_mode)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).dp_ss_mode) as usize - ptr as usize },
        30usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_display_controller_info_v4_1),
            "::",
            stringify!(dp_ss_mode)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ss_reserved) as usize - ptr as usize },
        31usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_display_controller_info_v4_1),
            "::",
            stringify!(ss_reserved)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).hardcode_mode_num) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_display_controller_info_v4_1),
            "::",
            stringify!(hardcode_mode_num)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).reserved1) as usize - ptr as usize },
        33usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_display_controller_info_v4_1),
            "::",
            stringify!(reserved1)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).dpphy_refclk_10khz) as usize - ptr as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_display_controller_info_v4_1),
            "::",
            stringify!(dpphy_refclk_10khz)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).reserved2) as usize - ptr as usize },
        38usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_display_controller_info_v4_1),
            "::",
            stringify!(reserved2)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).dceip_min_ver) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_display_controller_info_v4_1),
            "::",
            stringify!(dceip_min_ver)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).dceip_max_ver) as usize - ptr as usize },
        41usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_display_controller_info_v4_1),
            "::",
            stringify!(dceip_max_ver)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).max_disp_pipe_num) as usize - ptr as usize },
        42usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_display_controller_info_v4_1),
            "::",
            stringify!(max_disp_pipe_num)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).max_vbios_active_disp_pipe_num) as usize - ptr as usize
        },
        43usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_display_controller_info_v4_1),
            "::",
            stringify!(max_vbios_active_disp_pipe_num)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).max_ppll_num) as usize - ptr as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_display_controller_info_v4_1),
            "::",
            stringify!(max_ppll_num)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).max_disp_phy_num) as usize - ptr as usize },
        45usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_display_controller_info_v4_1),
            "::",
            stringify!(max_disp_phy_num)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).max_aux_pairs) as usize - ptr as usize },
        46usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_display_controller_info_v4_1),
            "::",
            stringify!(max_aux_pairs)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).remotedisplayconfig) as usize - ptr as usize },
        47usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_display_controller_info_v4_1),
            "::",
            stringify!(remotedisplayconfig)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).reserved3) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_display_controller_info_v4_1),
            "::",
            stringify!(reserved3)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct atom_display_controller_info_v4_2 {
    pub table_header: atom_common_table_header,
    pub display_caps: u32,
    pub bootup_dispclk_10khz: u32,
    pub dce_refclk_10khz: u16,
    pub i2c_engine_refclk_10khz: u16,
    pub dvi_ss_percentage: u16,
    pub dvi_ss_rate_10hz: u16,
    pub hdmi_ss_percentage: u16,
    pub hdmi_ss_rate_10hz: u16,
    pub dp_ss_percentage: u16,
    pub dp_ss_rate_10hz: u16,
    pub dvi_ss_mode: u8,
    pub hdmi_ss_mode: u8,
    pub dp_ss_mode: u8,
    pub ss_reserved: u8,
    pub dfp_hardcode_mode_num: u8,
    pub dfp_hardcode_refreshrate: u8,
    pub vga_hardcode_mode_num: u8,
    pub vga_hardcode_refreshrate: u8,
    pub dpphy_refclk_10khz: u16,
    pub reserved2: u16,
    pub dcnip_min_ver: u8,
    pub dcnip_max_ver: u8,
    pub max_disp_pipe_num: u8,
    pub max_vbios_active_disp_pipe_num: u8,
    pub max_ppll_num: u8,
    pub max_disp_phy_num: u8,
    pub max_aux_pairs: u8,
    pub remotedisplayconfig: u8,
    pub reserved3: [u8; 8usize],
}
#[test]
fn bindgen_test_layout_atom_display_controller_info_v4_2() {
    const UNINIT: ::core::mem::MaybeUninit<atom_display_controller_info_v4_2> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<atom_display_controller_info_v4_2>(),
        56usize,
        concat!("Size of: ", stringify!(atom_display_controller_info_v4_2))
    );
    assert_eq!(
        ::core::mem::align_of::<atom_display_controller_info_v4_2>(),
        1usize,
        concat!(
            "Alignment of ",
            stringify!(atom_display_controller_info_v4_2)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).table_header) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_display_controller_info_v4_2),
            "::",
            stringify!(table_header)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).display_caps) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_display_controller_info_v4_2),
            "::",
            stringify!(display_caps)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).bootup_dispclk_10khz) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_display_controller_info_v4_2),
            "::",
            stringify!(bootup_dispclk_10khz)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).dce_refclk_10khz) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_display_controller_info_v4_2),
            "::",
            stringify!(dce_refclk_10khz)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).i2c_engine_refclk_10khz) as usize - ptr as usize },
        14usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_display_controller_info_v4_2),
            "::",
            stringify!(i2c_engine_refclk_10khz)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).dvi_ss_percentage) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_display_controller_info_v4_2),
            "::",
            stringify!(dvi_ss_percentage)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).dvi_ss_rate_10hz) as usize - ptr as usize },
        18usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_display_controller_info_v4_2),
            "::",
            stringify!(dvi_ss_rate_10hz)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).hdmi_ss_percentage) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_display_controller_info_v4_2),
            "::",
            stringify!(hdmi_ss_percentage)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).hdmi_ss_rate_10hz) as usize - ptr as usize },
        22usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_display_controller_info_v4_2),
            "::",
            stringify!(hdmi_ss_rate_10hz)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).dp_ss_percentage) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_display_controller_info_v4_2),
            "::",
            stringify!(dp_ss_percentage)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).dp_ss_rate_10hz) as usize - ptr as usize },
        26usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_display_controller_info_v4_2),
            "::",
            stringify!(dp_ss_rate_10hz)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).dvi_ss_mode) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_display_controller_info_v4_2),
            "::",
            stringify!(dvi_ss_mode)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).hdmi_ss_mode) as usize - ptr as usize },
        29usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_display_controller_info_v4_2),
            "::",
            stringify!(hdmi_ss_mode)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).dp_ss_mode) as usize - ptr as usize },
        30usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_display_controller_info_v4_2),
            "::",
            stringify!(dp_ss_mode)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ss_reserved) as usize - ptr as usize },
        31usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_display_controller_info_v4_2),
            "::",
            stringify!(ss_reserved)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).dfp_hardcode_mode_num) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_display_controller_info_v4_2),
            "::",
            stringify!(dfp_hardcode_mode_num)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).dfp_hardcode_refreshrate) as usize - ptr as usize },
        33usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_display_controller_info_v4_2),
            "::",
            stringify!(dfp_hardcode_refreshrate)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).vga_hardcode_mode_num) as usize - ptr as usize },
        34usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_display_controller_info_v4_2),
            "::",
            stringify!(vga_hardcode_mode_num)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).vga_hardcode_refreshrate) as usize - ptr as usize },
        35usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_display_controller_info_v4_2),
            "::",
            stringify!(vga_hardcode_refreshrate)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).dpphy_refclk_10khz) as usize - ptr as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_display_controller_info_v4_2),
            "::",
            stringify!(dpphy_refclk_10khz)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).reserved2) as usize - ptr as usize },
        38usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_display_controller_info_v4_2),
            "::",
            stringify!(reserved2)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).dcnip_min_ver) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_display_controller_info_v4_2),
            "::",
            stringify!(dcnip_min_ver)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).dcnip_max_ver) as usize - ptr as usize },
        41usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_display_controller_info_v4_2),
            "::",
            stringify!(dcnip_max_ver)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).max_disp_pipe_num) as usize - ptr as usize },
        42usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_display_controller_info_v4_2),
            "::",
            stringify!(max_disp_pipe_num)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).max_vbios_active_disp_pipe_num) as usize - ptr as usize
        },
        43usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_display_controller_info_v4_2),
            "::",
            stringify!(max_vbios_active_disp_pipe_num)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).max_ppll_num) as usize - ptr as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_display_controller_info_v4_2),
            "::",
            stringify!(max_ppll_num)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).max_disp_phy_num) as usize - ptr as usize },
        45usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_display_controller_info_v4_2),
            "::",
            stringify!(max_disp_phy_num)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).max_aux_pairs) as usize - ptr as usize },
        46usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_display_controller_info_v4_2),
            "::",
            stringify!(max_aux_pairs)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).remotedisplayconfig) as usize - ptr as usize },
        47usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_display_controller_info_v4_2),
            "::",
            stringify!(remotedisplayconfig)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).reserved3) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_display_controller_info_v4_2),
            "::",
            stringify!(reserved3)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct atom_display_controller_info_v4_3 {
    pub table_header: atom_common_table_header,
    pub display_caps: u32,
    pub bootup_dispclk_10khz: u32,
    pub dce_refclk_10khz: u16,
    pub i2c_engine_refclk_10khz: u16,
    pub dvi_ss_percentage: u16,
    pub dvi_ss_rate_10hz: u16,
    pub hdmi_ss_percentage: u16,
    pub hdmi_ss_rate_10hz: u16,
    pub dp_ss_percentage: u16,
    pub dp_ss_rate_10hz: u16,
    pub dvi_ss_mode: u8,
    pub hdmi_ss_mode: u8,
    pub dp_ss_mode: u8,
    pub ss_reserved: u8,
    pub dfp_hardcode_mode_num: u8,
    pub dfp_hardcode_refreshrate: u8,
    pub vga_hardcode_mode_num: u8,
    pub vga_hardcode_refreshrate: u8,
    pub dpphy_refclk_10khz: u16,
    pub reserved2: u16,
    pub dcnip_min_ver: u8,
    pub dcnip_max_ver: u8,
    pub max_disp_pipe_num: u8,
    pub max_vbios_active_disp_pipe_num: u8,
    pub max_ppll_num: u8,
    pub max_disp_phy_num: u8,
    pub max_aux_pairs: u8,
    pub remotedisplayconfig: u8,
    pub reserved3: [u8; 8usize],
}
#[test]
fn bindgen_test_layout_atom_display_controller_info_v4_3() {
    const UNINIT: ::core::mem::MaybeUninit<atom_display_controller_info_v4_3> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<atom_display_controller_info_v4_3>(),
        56usize,
        concat!("Size of: ", stringify!(atom_display_controller_info_v4_3))
    );
    assert_eq!(
        ::core::mem::align_of::<atom_display_controller_info_v4_3>(),
        1usize,
        concat!(
            "Alignment of ",
            stringify!(atom_display_controller_info_v4_3)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).table_header) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_display_controller_info_v4_3),
            "::",
            stringify!(table_header)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).display_caps) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_display_controller_info_v4_3),
            "::",
            stringify!(display_caps)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).bootup_dispclk_10khz) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_display_controller_info_v4_3),
            "::",
            stringify!(bootup_dispclk_10khz)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).dce_refclk_10khz) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_display_controller_info_v4_3),
            "::",
            stringify!(dce_refclk_10khz)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).i2c_engine_refclk_10khz) as usize - ptr as usize },
        14usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_display_controller_info_v4_3),
            "::",
            stringify!(i2c_engine_refclk_10khz)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).dvi_ss_percentage) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_display_controller_info_v4_3),
            "::",
            stringify!(dvi_ss_percentage)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).dvi_ss_rate_10hz) as usize - ptr as usize },
        18usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_display_controller_info_v4_3),
            "::",
            stringify!(dvi_ss_rate_10hz)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).hdmi_ss_percentage) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_display_controller_info_v4_3),
            "::",
            stringify!(hdmi_ss_percentage)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).hdmi_ss_rate_10hz) as usize - ptr as usize },
        22usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_display_controller_info_v4_3),
            "::",
            stringify!(hdmi_ss_rate_10hz)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).dp_ss_percentage) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_display_controller_info_v4_3),
            "::",
            stringify!(dp_ss_percentage)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).dp_ss_rate_10hz) as usize - ptr as usize },
        26usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_display_controller_info_v4_3),
            "::",
            stringify!(dp_ss_rate_10hz)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).dvi_ss_mode) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_display_controller_info_v4_3),
            "::",
            stringify!(dvi_ss_mode)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).hdmi_ss_mode) as usize - ptr as usize },
        29usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_display_controller_info_v4_3),
            "::",
            stringify!(hdmi_ss_mode)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).dp_ss_mode) as usize - ptr as usize },
        30usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_display_controller_info_v4_3),
            "::",
            stringify!(dp_ss_mode)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ss_reserved) as usize - ptr as usize },
        31usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_display_controller_info_v4_3),
            "::",
            stringify!(ss_reserved)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).dfp_hardcode_mode_num) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_display_controller_info_v4_3),
            "::",
            stringify!(dfp_hardcode_mode_num)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).dfp_hardcode_refreshrate) as usize - ptr as usize },
        33usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_display_controller_info_v4_3),
            "::",
            stringify!(dfp_hardcode_refreshrate)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).vga_hardcode_mode_num) as usize - ptr as usize },
        34usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_display_controller_info_v4_3),
            "::",
            stringify!(vga_hardcode_mode_num)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).vga_hardcode_refreshrate) as usize - ptr as usize },
        35usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_display_controller_info_v4_3),
            "::",
            stringify!(vga_hardcode_refreshrate)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).dpphy_refclk_10khz) as usize - ptr as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_display_controller_info_v4_3),
            "::",
            stringify!(dpphy_refclk_10khz)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).reserved2) as usize - ptr as usize },
        38usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_display_controller_info_v4_3),
            "::",
            stringify!(reserved2)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).dcnip_min_ver) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_display_controller_info_v4_3),
            "::",
            stringify!(dcnip_min_ver)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).dcnip_max_ver) as usize - ptr as usize },
        41usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_display_controller_info_v4_3),
            "::",
            stringify!(dcnip_max_ver)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).max_disp_pipe_num) as usize - ptr as usize },
        42usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_display_controller_info_v4_3),
            "::",
            stringify!(max_disp_pipe_num)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).max_vbios_active_disp_pipe_num) as usize - ptr as usize
        },
        43usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_display_controller_info_v4_3),
            "::",
            stringify!(max_vbios_active_disp_pipe_num)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).max_ppll_num) as usize - ptr as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_display_controller_info_v4_3),
            "::",
            stringify!(max_ppll_num)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).max_disp_phy_num) as usize - ptr as usize },
        45usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_display_controller_info_v4_3),
            "::",
            stringify!(max_disp_phy_num)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).max_aux_pairs) as usize - ptr as usize },
        46usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_display_controller_info_v4_3),
            "::",
            stringify!(max_aux_pairs)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).remotedisplayconfig) as usize - ptr as usize },
        47usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_display_controller_info_v4_3),
            "::",
            stringify!(remotedisplayconfig)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).reserved3) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_display_controller_info_v4_3),
            "::",
            stringify!(reserved3)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct atom_display_controller_info_v4_4 {
    pub table_header: atom_common_table_header,
    pub display_caps: u32,
    pub bootup_dispclk_10khz: u32,
    pub dce_refclk_10khz: u16,
    pub i2c_engine_refclk_10khz: u16,
    pub dvi_ss_percentage: u16,
    pub dvi_ss_rate_10hz: u16,
    pub hdmi_ss_percentage: u16,
    pub hdmi_ss_rate_10hz: u16,
    pub dp_ss_percentage: u16,
    pub dp_ss_rate_10hz: u16,
    pub dvi_ss_mode: u8,
    pub hdmi_ss_mode: u8,
    pub dp_ss_mode: u8,
    pub ss_reserved: u8,
    pub dfp_hardcode_mode_num: u8,
    pub dfp_hardcode_refreshrate: u8,
    pub vga_hardcode_mode_num: u8,
    pub vga_hardcode_refreshrate: u8,
    pub dpphy_refclk_10khz: u16,
    pub hw_chip_id: u16,
    pub dcnip_min_ver: u8,
    pub dcnip_max_ver: u8,
    pub max_disp_pipe_num: u8,
    pub max_vbios_active_disp_pipum: u8,
    pub max_ppll_num: u8,
    pub max_disp_phy_num: u8,
    pub max_aux_pairs: u8,
    pub remotedisplayconfig: u8,
    pub dispclk_pll_vco_freq: u32,
    pub dp_ref_clk_freq: u32,
    pub max_mclk_chg_lat: u32,
    pub max_sr_exit_lat: u32,
    pub max_sr_enter_exit_lat: u32,
    pub dc_golden_table_offset: u16,
    pub dc_golden_table_ver: u16,
    pub reserved3: [u32; 3usize],
}
#[test]
fn bindgen_test_layout_atom_display_controller_info_v4_4() {
    const UNINIT: ::core::mem::MaybeUninit<atom_display_controller_info_v4_4> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<atom_display_controller_info_v4_4>(),
        84usize,
        concat!("Size of: ", stringify!(atom_display_controller_info_v4_4))
    );
    assert_eq!(
        ::core::mem::align_of::<atom_display_controller_info_v4_4>(),
        1usize,
        concat!(
            "Alignment of ",
            stringify!(atom_display_controller_info_v4_4)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).table_header) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_display_controller_info_v4_4),
            "::",
            stringify!(table_header)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).display_caps) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_display_controller_info_v4_4),
            "::",
            stringify!(display_caps)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).bootup_dispclk_10khz) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_display_controller_info_v4_4),
            "::",
            stringify!(bootup_dispclk_10khz)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).dce_refclk_10khz) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_display_controller_info_v4_4),
            "::",
            stringify!(dce_refclk_10khz)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).i2c_engine_refclk_10khz) as usize - ptr as usize },
        14usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_display_controller_info_v4_4),
            "::",
            stringify!(i2c_engine_refclk_10khz)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).dvi_ss_percentage) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_display_controller_info_v4_4),
            "::",
            stringify!(dvi_ss_percentage)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).dvi_ss_rate_10hz) as usize - ptr as usize },
        18usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_display_controller_info_v4_4),
            "::",
            stringify!(dvi_ss_rate_10hz)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).hdmi_ss_percentage) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_display_controller_info_v4_4),
            "::",
            stringify!(hdmi_ss_percentage)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).hdmi_ss_rate_10hz) as usize - ptr as usize },
        22usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_display_controller_info_v4_4),
            "::",
            stringify!(hdmi_ss_rate_10hz)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).dp_ss_percentage) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_display_controller_info_v4_4),
            "::",
            stringify!(dp_ss_percentage)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).dp_ss_rate_10hz) as usize - ptr as usize },
        26usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_display_controller_info_v4_4),
            "::",
            stringify!(dp_ss_rate_10hz)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).dvi_ss_mode) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_display_controller_info_v4_4),
            "::",
            stringify!(dvi_ss_mode)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).hdmi_ss_mode) as usize - ptr as usize },
        29usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_display_controller_info_v4_4),
            "::",
            stringify!(hdmi_ss_mode)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).dp_ss_mode) as usize - ptr as usize },
        30usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_display_controller_info_v4_4),
            "::",
            stringify!(dp_ss_mode)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ss_reserved) as usize - ptr as usize },
        31usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_display_controller_info_v4_4),
            "::",
            stringify!(ss_reserved)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).dfp_hardcode_mode_num) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_display_controller_info_v4_4),
            "::",
            stringify!(dfp_hardcode_mode_num)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).dfp_hardcode_refreshrate) as usize - ptr as usize },
        33usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_display_controller_info_v4_4),
            "::",
            stringify!(dfp_hardcode_refreshrate)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).vga_hardcode_mode_num) as usize - ptr as usize },
        34usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_display_controller_info_v4_4),
            "::",
            stringify!(vga_hardcode_mode_num)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).vga_hardcode_refreshrate) as usize - ptr as usize },
        35usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_display_controller_info_v4_4),
            "::",
            stringify!(vga_hardcode_refreshrate)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).dpphy_refclk_10khz) as usize - ptr as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_display_controller_info_v4_4),
            "::",
            stringify!(dpphy_refclk_10khz)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).hw_chip_id) as usize - ptr as usize },
        38usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_display_controller_info_v4_4),
            "::",
            stringify!(hw_chip_id)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).dcnip_min_ver) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_display_controller_info_v4_4),
            "::",
            stringify!(dcnip_min_ver)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).dcnip_max_ver) as usize - ptr as usize },
        41usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_display_controller_info_v4_4),
            "::",
            stringify!(dcnip_max_ver)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).max_disp_pipe_num) as usize - ptr as usize },
        42usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_display_controller_info_v4_4),
            "::",
            stringify!(max_disp_pipe_num)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).max_vbios_active_disp_pipum) as usize - ptr as usize
        },
        43usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_display_controller_info_v4_4),
            "::",
            stringify!(max_vbios_active_disp_pipum)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).max_ppll_num) as usize - ptr as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_display_controller_info_v4_4),
            "::",
            stringify!(max_ppll_num)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).max_disp_phy_num) as usize - ptr as usize },
        45usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_display_controller_info_v4_4),
            "::",
            stringify!(max_disp_phy_num)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).max_aux_pairs) as usize - ptr as usize },
        46usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_display_controller_info_v4_4),
            "::",
            stringify!(max_aux_pairs)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).remotedisplayconfig) as usize - ptr as usize },
        47usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_display_controller_info_v4_4),
            "::",
            stringify!(remotedisplayconfig)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).dispclk_pll_vco_freq) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_display_controller_info_v4_4),
            "::",
            stringify!(dispclk_pll_vco_freq)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).dp_ref_clk_freq) as usize - ptr as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_display_controller_info_v4_4),
            "::",
            stringify!(dp_ref_clk_freq)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).max_mclk_chg_lat) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_display_controller_info_v4_4),
            "::",
            stringify!(max_mclk_chg_lat)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).max_sr_exit_lat) as usize - ptr as usize },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_display_controller_info_v4_4),
            "::",
            stringify!(max_sr_exit_lat)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).max_sr_enter_exit_lat) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_display_controller_info_v4_4),
            "::",
            stringify!(max_sr_enter_exit_lat)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).dc_golden_table_offset) as usize - ptr as usize },
        68usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_display_controller_info_v4_4),
            "::",
            stringify!(dc_golden_table_offset)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).dc_golden_table_ver) as usize - ptr as usize },
        70usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_display_controller_info_v4_4),
            "::",
            stringify!(dc_golden_table_ver)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).reserved3) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_display_controller_info_v4_4),
            "::",
            stringify!(reserved3)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct atom_dc_golden_table_v1 {
    pub aux_dphy_rx_control0_val: u32,
    pub aux_dphy_tx_control_val: u32,
    pub aux_dphy_rx_control1_val: u32,
    pub dc_gpio_aux_ctrl_0_val: u32,
    pub dc_gpio_aux_ctrl_1_val: u32,
    pub dc_gpio_aux_ctrl_2_val: u32,
    pub dc_gpio_aux_ctrl_3_val: u32,
    pub dc_gpio_aux_ctrl_4_val: u32,
    pub dc_gpio_aux_ctrl_5_val: u32,
    pub reserved: [u32; 23usize],
}
#[test]
fn bindgen_test_layout_atom_dc_golden_table_v1() {
    const UNINIT: ::core::mem::MaybeUninit<atom_dc_golden_table_v1> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<atom_dc_golden_table_v1>(),
        128usize,
        concat!("Size of: ", stringify!(atom_dc_golden_table_v1))
    );
    assert_eq!(
        ::core::mem::align_of::<atom_dc_golden_table_v1>(),
        1usize,
        concat!("Alignment of ", stringify!(atom_dc_golden_table_v1))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).aux_dphy_rx_control0_val) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_dc_golden_table_v1),
            "::",
            stringify!(aux_dphy_rx_control0_val)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).aux_dphy_tx_control_val) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_dc_golden_table_v1),
            "::",
            stringify!(aux_dphy_tx_control_val)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).aux_dphy_rx_control1_val) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_dc_golden_table_v1),
            "::",
            stringify!(aux_dphy_rx_control1_val)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).dc_gpio_aux_ctrl_0_val) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_dc_golden_table_v1),
            "::",
            stringify!(dc_gpio_aux_ctrl_0_val)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).dc_gpio_aux_ctrl_1_val) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_dc_golden_table_v1),
            "::",
            stringify!(dc_gpio_aux_ctrl_1_val)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).dc_gpio_aux_ctrl_2_val) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_dc_golden_table_v1),
            "::",
            stringify!(dc_gpio_aux_ctrl_2_val)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).dc_gpio_aux_ctrl_3_val) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_dc_golden_table_v1),
            "::",
            stringify!(dc_gpio_aux_ctrl_3_val)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).dc_gpio_aux_ctrl_4_val) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_dc_golden_table_v1),
            "::",
            stringify!(dc_gpio_aux_ctrl_4_val)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).dc_gpio_aux_ctrl_5_val) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_dc_golden_table_v1),
            "::",
            stringify!(dc_gpio_aux_ctrl_5_val)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).reserved) as usize - ptr as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_dc_golden_table_v1),
            "::",
            stringify!(reserved)
        )
    );
}
pub const dce_info_caps_def_DCE_INFO_CAPS_FORCE_DISPDEV_CONNECTED: dce_info_caps_def = 2;
pub const dce_info_caps_def_DCE_INFO_CAPS_DISABLE_DFP_DP_HBR2: dce_info_caps_def = 4;
pub const dce_info_caps_def_DCE_INFO_CAPS_ENABLE_INTERLAC_TIMING: dce_info_caps_def = 8;
pub const dce_info_caps_def_DCE_INFO_CAPS_LTTPR_SUPPORT_ENABLE: dce_info_caps_def = 32;
pub const dce_info_caps_def_DCE_INFO_CAPS_VBIOS_LTTPR_TRANSPARENT_ENABLE: dce_info_caps_def = 64;
pub type dce_info_caps_def = ::core::ffi::c_uint;
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct atom_display_controller_info_v4_5 {
    pub table_header: atom_common_table_header,
    pub display_caps: u32,
    pub bootup_dispclk_10khz: u32,
    pub dce_refclk_10khz: u16,
    pub i2c_engine_refclk_10khz: u16,
    pub dvi_ss_percentage: u16,
    pub dvi_ss_rate_10hz: u16,
    pub hdmi_ss_percentage: u16,
    pub hdmi_ss_rate_10hz: u16,
    pub dp_ss_percentage: u16,
    pub dp_ss_rate_10hz: u16,
    pub dvi_ss_mode: u8,
    pub hdmi_ss_mode: u8,
    pub dp_ss_mode: u8,
    pub ss_reserved: u8,
    pub dfp_hardcode_mode_num: u8,
    pub dfp_hardcode_refreshrate: u8,
    pub vga_hardcode_mode_num: u8,
    pub vga_hardcode_refreshrate: u8,
    pub dpphy_refclk_10khz: u16,
    pub hw_chip_id: u16,
    pub dcnip_min_ver: u8,
    pub dcnip_max_ver: u8,
    pub max_disp_pipe_num: u8,
    pub max_vbios_active_disp_pipe_num: u8,
    pub max_ppll_num: u8,
    pub max_disp_phy_num: u8,
    pub max_aux_pairs: u8,
    pub remotedisplayconfig: u8,
    pub dispclk_pll_vco_freq: u32,
    pub dp_ref_clk_freq: u32,
    pub max_mclk_chg_lat: u32,
    pub max_sr_exit_lat: u32,
    pub max_sr_enter_exit_lat: u32,
    pub dc_golden_table_offset: u16,
    pub dc_golden_table_ver: u16,
    pub aux_dphy_rx_control0_val: u32,
    pub aux_dphy_tx_control_val: u32,
    pub aux_dphy_rx_control1_val: u32,
    pub dc_gpio_aux_ctrl_0_val: u32,
    pub dc_gpio_aux_ctrl_1_val: u32,
    pub dc_gpio_aux_ctrl_2_val: u32,
    pub dc_gpio_aux_ctrl_3_val: u32,
    pub dc_gpio_aux_ctrl_4_val: u32,
    pub dc_gpio_aux_ctrl_5_val: u32,
    pub reserved: [u32; 26usize],
}
#[test]
fn bindgen_test_layout_atom_display_controller_info_v4_5() {
    const UNINIT: ::core::mem::MaybeUninit<atom_display_controller_info_v4_5> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<atom_display_controller_info_v4_5>(),
        212usize,
        concat!("Size of: ", stringify!(atom_display_controller_info_v4_5))
    );
    assert_eq!(
        ::core::mem::align_of::<atom_display_controller_info_v4_5>(),
        1usize,
        concat!(
            "Alignment of ",
            stringify!(atom_display_controller_info_v4_5)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).table_header) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_display_controller_info_v4_5),
            "::",
            stringify!(table_header)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).display_caps) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_display_controller_info_v4_5),
            "::",
            stringify!(display_caps)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).bootup_dispclk_10khz) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_display_controller_info_v4_5),
            "::",
            stringify!(bootup_dispclk_10khz)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).dce_refclk_10khz) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_display_controller_info_v4_5),
            "::",
            stringify!(dce_refclk_10khz)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).i2c_engine_refclk_10khz) as usize - ptr as usize },
        14usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_display_controller_info_v4_5),
            "::",
            stringify!(i2c_engine_refclk_10khz)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).dvi_ss_percentage) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_display_controller_info_v4_5),
            "::",
            stringify!(dvi_ss_percentage)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).dvi_ss_rate_10hz) as usize - ptr as usize },
        18usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_display_controller_info_v4_5),
            "::",
            stringify!(dvi_ss_rate_10hz)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).hdmi_ss_percentage) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_display_controller_info_v4_5),
            "::",
            stringify!(hdmi_ss_percentage)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).hdmi_ss_rate_10hz) as usize - ptr as usize },
        22usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_display_controller_info_v4_5),
            "::",
            stringify!(hdmi_ss_rate_10hz)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).dp_ss_percentage) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_display_controller_info_v4_5),
            "::",
            stringify!(dp_ss_percentage)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).dp_ss_rate_10hz) as usize - ptr as usize },
        26usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_display_controller_info_v4_5),
            "::",
            stringify!(dp_ss_rate_10hz)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).dvi_ss_mode) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_display_controller_info_v4_5),
            "::",
            stringify!(dvi_ss_mode)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).hdmi_ss_mode) as usize - ptr as usize },
        29usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_display_controller_info_v4_5),
            "::",
            stringify!(hdmi_ss_mode)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).dp_ss_mode) as usize - ptr as usize },
        30usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_display_controller_info_v4_5),
            "::",
            stringify!(dp_ss_mode)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ss_reserved) as usize - ptr as usize },
        31usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_display_controller_info_v4_5),
            "::",
            stringify!(ss_reserved)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).dfp_hardcode_mode_num) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_display_controller_info_v4_5),
            "::",
            stringify!(dfp_hardcode_mode_num)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).dfp_hardcode_refreshrate) as usize - ptr as usize },
        33usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_display_controller_info_v4_5),
            "::",
            stringify!(dfp_hardcode_refreshrate)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).vga_hardcode_mode_num) as usize - ptr as usize },
        34usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_display_controller_info_v4_5),
            "::",
            stringify!(vga_hardcode_mode_num)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).vga_hardcode_refreshrate) as usize - ptr as usize },
        35usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_display_controller_info_v4_5),
            "::",
            stringify!(vga_hardcode_refreshrate)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).dpphy_refclk_10khz) as usize - ptr as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_display_controller_info_v4_5),
            "::",
            stringify!(dpphy_refclk_10khz)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).hw_chip_id) as usize - ptr as usize },
        38usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_display_controller_info_v4_5),
            "::",
            stringify!(hw_chip_id)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).dcnip_min_ver) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_display_controller_info_v4_5),
            "::",
            stringify!(dcnip_min_ver)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).dcnip_max_ver) as usize - ptr as usize },
        41usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_display_controller_info_v4_5),
            "::",
            stringify!(dcnip_max_ver)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).max_disp_pipe_num) as usize - ptr as usize },
        42usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_display_controller_info_v4_5),
            "::",
            stringify!(max_disp_pipe_num)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).max_vbios_active_disp_pipe_num) as usize - ptr as usize
        },
        43usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_display_controller_info_v4_5),
            "::",
            stringify!(max_vbios_active_disp_pipe_num)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).max_ppll_num) as usize - ptr as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_display_controller_info_v4_5),
            "::",
            stringify!(max_ppll_num)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).max_disp_phy_num) as usize - ptr as usize },
        45usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_display_controller_info_v4_5),
            "::",
            stringify!(max_disp_phy_num)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).max_aux_pairs) as usize - ptr as usize },
        46usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_display_controller_info_v4_5),
            "::",
            stringify!(max_aux_pairs)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).remotedisplayconfig) as usize - ptr as usize },
        47usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_display_controller_info_v4_5),
            "::",
            stringify!(remotedisplayconfig)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).dispclk_pll_vco_freq) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_display_controller_info_v4_5),
            "::",
            stringify!(dispclk_pll_vco_freq)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).dp_ref_clk_freq) as usize - ptr as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_display_controller_info_v4_5),
            "::",
            stringify!(dp_ref_clk_freq)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).max_mclk_chg_lat) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_display_controller_info_v4_5),
            "::",
            stringify!(max_mclk_chg_lat)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).max_sr_exit_lat) as usize - ptr as usize },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_display_controller_info_v4_5),
            "::",
            stringify!(max_sr_exit_lat)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).max_sr_enter_exit_lat) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_display_controller_info_v4_5),
            "::",
            stringify!(max_sr_enter_exit_lat)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).dc_golden_table_offset) as usize - ptr as usize },
        68usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_display_controller_info_v4_5),
            "::",
            stringify!(dc_golden_table_offset)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).dc_golden_table_ver) as usize - ptr as usize },
        70usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_display_controller_info_v4_5),
            "::",
            stringify!(dc_golden_table_ver)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).aux_dphy_rx_control0_val) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_display_controller_info_v4_5),
            "::",
            stringify!(aux_dphy_rx_control0_val)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).aux_dphy_tx_control_val) as usize - ptr as usize },
        76usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_display_controller_info_v4_5),
            "::",
            stringify!(aux_dphy_tx_control_val)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).aux_dphy_rx_control1_val) as usize - ptr as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_display_controller_info_v4_5),
            "::",
            stringify!(aux_dphy_rx_control1_val)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).dc_gpio_aux_ctrl_0_val) as usize - ptr as usize },
        84usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_display_controller_info_v4_5),
            "::",
            stringify!(dc_gpio_aux_ctrl_0_val)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).dc_gpio_aux_ctrl_1_val) as usize - ptr as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_display_controller_info_v4_5),
            "::",
            stringify!(dc_gpio_aux_ctrl_1_val)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).dc_gpio_aux_ctrl_2_val) as usize - ptr as usize },
        92usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_display_controller_info_v4_5),
            "::",
            stringify!(dc_gpio_aux_ctrl_2_val)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).dc_gpio_aux_ctrl_3_val) as usize - ptr as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_display_controller_info_v4_5),
            "::",
            stringify!(dc_gpio_aux_ctrl_3_val)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).dc_gpio_aux_ctrl_4_val) as usize - ptr as usize },
        100usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_display_controller_info_v4_5),
            "::",
            stringify!(dc_gpio_aux_ctrl_4_val)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).dc_gpio_aux_ctrl_5_val) as usize - ptr as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_display_controller_info_v4_5),
            "::",
            stringify!(dc_gpio_aux_ctrl_5_val)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).reserved) as usize - ptr as usize },
        108usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_display_controller_info_v4_5),
            "::",
            stringify!(reserved)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct atom_ext_display_path {
    pub device_tag: u16,
    pub device_acpi_enum: u16,
    pub connectorobjid: u16,
    pub auxddclut_index: u8,
    pub hpdlut_index: u8,
    pub ext_encoder_objid: u16,
    pub channelmapping: u8,
    pub chpninvert: u8,
    pub caps: u16,
    pub reserved: u16,
}
#[test]
fn bindgen_test_layout_atom_ext_display_path() {
    const UNINIT: ::core::mem::MaybeUninit<atom_ext_display_path> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<atom_ext_display_path>(),
        16usize,
        concat!("Size of: ", stringify!(atom_ext_display_path))
    );
    assert_eq!(
        ::core::mem::align_of::<atom_ext_display_path>(),
        1usize,
        concat!("Alignment of ", stringify!(atom_ext_display_path))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).device_tag) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_ext_display_path),
            "::",
            stringify!(device_tag)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).device_acpi_enum) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_ext_display_path),
            "::",
            stringify!(device_acpi_enum)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).connectorobjid) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_ext_display_path),
            "::",
            stringify!(connectorobjid)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).auxddclut_index) as usize - ptr as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_ext_display_path),
            "::",
            stringify!(auxddclut_index)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).hpdlut_index) as usize - ptr as usize },
        7usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_ext_display_path),
            "::",
            stringify!(hpdlut_index)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ext_encoder_objid) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_ext_display_path),
            "::",
            stringify!(ext_encoder_objid)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).channelmapping) as usize - ptr as usize },
        10usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_ext_display_path),
            "::",
            stringify!(channelmapping)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).chpninvert) as usize - ptr as usize },
        11usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_ext_display_path),
            "::",
            stringify!(chpninvert)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).caps) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_ext_display_path),
            "::",
            stringify!(caps)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).reserved) as usize - ptr as usize },
        14usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_ext_display_path),
            "::",
            stringify!(reserved)
        )
    );
}
pub const ext_display_path_cap_def_EXT_DISPLAY_PATH_CAPS__HBR2_DISABLE: ext_display_path_cap_def =
    1;
pub const ext_display_path_cap_def_EXT_DISPLAY_PATH_CAPS__DP_FIXED_VS_EN: ext_display_path_cap_def =
    2;
pub const ext_display_path_cap_def_EXT_DISPLAY_PATH_CAPS__EXT_CHIP_MASK: ext_display_path_cap_def =
    124;
pub const ext_display_path_cap_def_EXT_DISPLAY_PATH_CAPS__HDMI20_PI3EQX1204:
    ext_display_path_cap_def = 4;
pub const ext_display_path_cap_def_EXT_DISPLAY_PATH_CAPS__HDMI20_TISN65DP159RSBT:
    ext_display_path_cap_def = 8;
pub const ext_display_path_cap_def_EXT_DISPLAY_PATH_CAPS__HDMI20_PARADE_PS175:
    ext_display_path_cap_def = 12;
pub type ext_display_path_cap_def = ::core::ffi::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct atom_external_display_connection_info {
    pub table_header: atom_common_table_header,
    pub guid: [u8; 16usize],
    pub path: [atom_ext_display_path; 7usize],
    pub checksum: u8,
    pub stereopinid: u8,
    pub remotedisplayconfig: u8,
    pub edptolvdsrxid: u8,
    pub fixdpvoltageswing: u8,
    pub reserved: [u8; 3usize],
}
#[test]
fn bindgen_test_layout_atom_external_display_connection_info() {
    const UNINIT: ::core::mem::MaybeUninit<atom_external_display_connection_info> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<atom_external_display_connection_info>(),
        140usize,
        concat!(
            "Size of: ",
            stringify!(atom_external_display_connection_info)
        )
    );
    assert_eq!(
        ::core::mem::align_of::<atom_external_display_connection_info>(),
        1usize,
        concat!(
            "Alignment of ",
            stringify!(atom_external_display_connection_info)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).table_header) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_external_display_connection_info),
            "::",
            stringify!(table_header)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).guid) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_external_display_connection_info),
            "::",
            stringify!(guid)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).path) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_external_display_connection_info),
            "::",
            stringify!(path)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).checksum) as usize - ptr as usize },
        132usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_external_display_connection_info),
            "::",
            stringify!(checksum)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).stereopinid) as usize - ptr as usize },
        133usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_external_display_connection_info),
            "::",
            stringify!(stereopinid)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).remotedisplayconfig) as usize - ptr as usize },
        134usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_external_display_connection_info),
            "::",
            stringify!(remotedisplayconfig)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).edptolvdsrxid) as usize - ptr as usize },
        135usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_external_display_connection_info),
            "::",
            stringify!(edptolvdsrxid)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).fixdpvoltageswing) as usize - ptr as usize },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_external_display_connection_info),
            "::",
            stringify!(fixdpvoltageswing)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).reserved) as usize - ptr as usize },
        137usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_external_display_connection_info),
            "::",
            stringify!(reserved)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct atom_camera_dphy_timing_param {
    pub profile_id: u8,
    pub param: u32,
}
#[test]
fn bindgen_test_layout_atom_camera_dphy_timing_param() {
    const UNINIT: ::core::mem::MaybeUninit<atom_camera_dphy_timing_param> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<atom_camera_dphy_timing_param>(),
        5usize,
        concat!("Size of: ", stringify!(atom_camera_dphy_timing_param))
    );
    assert_eq!(
        ::core::mem::align_of::<atom_camera_dphy_timing_param>(),
        1usize,
        concat!("Alignment of ", stringify!(atom_camera_dphy_timing_param))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).profile_id) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_camera_dphy_timing_param),
            "::",
            stringify!(profile_id)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).param) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_camera_dphy_timing_param),
            "::",
            stringify!(param)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct atom_camera_dphy_elec_param {
    pub param: [u16; 3usize],
}
#[test]
fn bindgen_test_layout_atom_camera_dphy_elec_param() {
    const UNINIT: ::core::mem::MaybeUninit<atom_camera_dphy_elec_param> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<atom_camera_dphy_elec_param>(),
        6usize,
        concat!("Size of: ", stringify!(atom_camera_dphy_elec_param))
    );
    assert_eq!(
        ::core::mem::align_of::<atom_camera_dphy_elec_param>(),
        1usize,
        concat!("Alignment of ", stringify!(atom_camera_dphy_elec_param))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).param) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_camera_dphy_elec_param),
            "::",
            stringify!(param)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct atom_camera_module_info {
    pub module_id: u8,
    pub module_name: [u8; 8usize],
    pub timingparam: [atom_camera_dphy_timing_param; 6usize],
}
#[test]
fn bindgen_test_layout_atom_camera_module_info() {
    const UNINIT: ::core::mem::MaybeUninit<atom_camera_module_info> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<atom_camera_module_info>(),
        39usize,
        concat!("Size of: ", stringify!(atom_camera_module_info))
    );
    assert_eq!(
        ::core::mem::align_of::<atom_camera_module_info>(),
        1usize,
        concat!("Alignment of ", stringify!(atom_camera_module_info))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).module_id) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_camera_module_info),
            "::",
            stringify!(module_id)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).module_name) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_camera_module_info),
            "::",
            stringify!(module_name)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).timingparam) as usize - ptr as usize },
        9usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_camera_module_info),
            "::",
            stringify!(timingparam)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct atom_camera_flashlight_info {
    pub flashlight_id: u8,
    pub name: [u8; 8usize],
}
#[test]
fn bindgen_test_layout_atom_camera_flashlight_info() {
    const UNINIT: ::core::mem::MaybeUninit<atom_camera_flashlight_info> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<atom_camera_flashlight_info>(),
        9usize,
        concat!("Size of: ", stringify!(atom_camera_flashlight_info))
    );
    assert_eq!(
        ::core::mem::align_of::<atom_camera_flashlight_info>(),
        1usize,
        concat!("Alignment of ", stringify!(atom_camera_flashlight_info))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).flashlight_id) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_camera_flashlight_info),
            "::",
            stringify!(flashlight_id)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).name) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_camera_flashlight_info),
            "::",
            stringify!(name)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct atom_camera_data {
    pub versionCode: u32,
    pub cameraInfo: [atom_camera_module_info; 3usize],
    pub flashInfo: atom_camera_flashlight_info,
    pub dphy_param: atom_camera_dphy_elec_param,
    pub crc_val: u32,
}
#[test]
fn bindgen_test_layout_atom_camera_data() {
    const UNINIT: ::core::mem::MaybeUninit<atom_camera_data> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<atom_camera_data>(),
        140usize,
        concat!("Size of: ", stringify!(atom_camera_data))
    );
    assert_eq!(
        ::core::mem::align_of::<atom_camera_data>(),
        1usize,
        concat!("Alignment of ", stringify!(atom_camera_data))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).versionCode) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_camera_data),
            "::",
            stringify!(versionCode)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).cameraInfo) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_camera_data),
            "::",
            stringify!(cameraInfo)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).flashInfo) as usize - ptr as usize },
        121usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_camera_data),
            "::",
            stringify!(flashInfo)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).dphy_param) as usize - ptr as usize },
        130usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_camera_data),
            "::",
            stringify!(dphy_param)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).crc_val) as usize - ptr as usize },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_camera_data),
            "::",
            stringify!(crc_val)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct atom_14nm_dpphy_dvihdmi_tuningset {
    pub max_symclk_in10khz: u32,
    pub encoder_mode: u8,
    pub phy_sel: u8,
    pub margindeemph: u16,
    pub deemph_6db_4: u8,
    pub boostadj: u8,
    pub tx_driver_fifty_ohms: u8,
    pub deemph_sel: u8,
}
#[test]
fn bindgen_test_layout_atom_14nm_dpphy_dvihdmi_tuningset() {
    const UNINIT: ::core::mem::MaybeUninit<atom_14nm_dpphy_dvihdmi_tuningset> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<atom_14nm_dpphy_dvihdmi_tuningset>(),
        12usize,
        concat!("Size of: ", stringify!(atom_14nm_dpphy_dvihdmi_tuningset))
    );
    assert_eq!(
        ::core::mem::align_of::<atom_14nm_dpphy_dvihdmi_tuningset>(),
        1usize,
        concat!(
            "Alignment of ",
            stringify!(atom_14nm_dpphy_dvihdmi_tuningset)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).max_symclk_in10khz) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_14nm_dpphy_dvihdmi_tuningset),
            "::",
            stringify!(max_symclk_in10khz)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).encoder_mode) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_14nm_dpphy_dvihdmi_tuningset),
            "::",
            stringify!(encoder_mode)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).phy_sel) as usize - ptr as usize },
        5usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_14nm_dpphy_dvihdmi_tuningset),
            "::",
            stringify!(phy_sel)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).margindeemph) as usize - ptr as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_14nm_dpphy_dvihdmi_tuningset),
            "::",
            stringify!(margindeemph)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).deemph_6db_4) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_14nm_dpphy_dvihdmi_tuningset),
            "::",
            stringify!(deemph_6db_4)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).boostadj) as usize - ptr as usize },
        9usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_14nm_dpphy_dvihdmi_tuningset),
            "::",
            stringify!(boostadj)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).tx_driver_fifty_ohms) as usize - ptr as usize },
        10usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_14nm_dpphy_dvihdmi_tuningset),
            "::",
            stringify!(tx_driver_fifty_ohms)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).deemph_sel) as usize - ptr as usize },
        11usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_14nm_dpphy_dvihdmi_tuningset),
            "::",
            stringify!(deemph_sel)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct atom_14nm_dpphy_dp_setting {
    pub dp_vs_pemph_level: u8,
    pub margindeemph: u16,
    pub deemph_6db_4: u8,
    pub boostadj: u8,
}
#[test]
fn bindgen_test_layout_atom_14nm_dpphy_dp_setting() {
    const UNINIT: ::core::mem::MaybeUninit<atom_14nm_dpphy_dp_setting> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<atom_14nm_dpphy_dp_setting>(),
        5usize,
        concat!("Size of: ", stringify!(atom_14nm_dpphy_dp_setting))
    );
    assert_eq!(
        ::core::mem::align_of::<atom_14nm_dpphy_dp_setting>(),
        1usize,
        concat!("Alignment of ", stringify!(atom_14nm_dpphy_dp_setting))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).dp_vs_pemph_level) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_14nm_dpphy_dp_setting),
            "::",
            stringify!(dp_vs_pemph_level)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).margindeemph) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_14nm_dpphy_dp_setting),
            "::",
            stringify!(margindeemph)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).deemph_6db_4) as usize - ptr as usize },
        3usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_14nm_dpphy_dp_setting),
            "::",
            stringify!(deemph_6db_4)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).boostadj) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_14nm_dpphy_dp_setting),
            "::",
            stringify!(boostadj)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct atom_14nm_dpphy_dp_tuningset {
    pub phy_sel: u8,
    pub version: u8,
    pub table_size: u16,
    pub reserved: u16,
    pub dptuning: [atom_14nm_dpphy_dp_setting; 10usize],
}
#[test]
fn bindgen_test_layout_atom_14nm_dpphy_dp_tuningset() {
    const UNINIT: ::core::mem::MaybeUninit<atom_14nm_dpphy_dp_tuningset> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<atom_14nm_dpphy_dp_tuningset>(),
        56usize,
        concat!("Size of: ", stringify!(atom_14nm_dpphy_dp_tuningset))
    );
    assert_eq!(
        ::core::mem::align_of::<atom_14nm_dpphy_dp_tuningset>(),
        1usize,
        concat!("Alignment of ", stringify!(atom_14nm_dpphy_dp_tuningset))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).phy_sel) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_14nm_dpphy_dp_tuningset),
            "::",
            stringify!(phy_sel)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).version) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_14nm_dpphy_dp_tuningset),
            "::",
            stringify!(version)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).table_size) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_14nm_dpphy_dp_tuningset),
            "::",
            stringify!(table_size)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).reserved) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_14nm_dpphy_dp_tuningset),
            "::",
            stringify!(reserved)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).dptuning) as usize - ptr as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_14nm_dpphy_dp_tuningset),
            "::",
            stringify!(dptuning)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct atom_14nm_dig_transmitter_info_header_v4_0 {
    pub table_header: atom_common_table_header,
    pub pcie_phy_tmds_hdmi_macro_settings_offset: u16,
    pub uniphy_vs_emph_lookup_table_offset: u16,
    pub uniphy_xbar_settings_table_offset: u16,
}
#[test]
fn bindgen_test_layout_atom_14nm_dig_transmitter_info_header_v4_0() {
    const UNINIT: ::core::mem::MaybeUninit<atom_14nm_dig_transmitter_info_header_v4_0> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<atom_14nm_dig_transmitter_info_header_v4_0>(),
        10usize,
        concat!(
            "Size of: ",
            stringify!(atom_14nm_dig_transmitter_info_header_v4_0)
        )
    );
    assert_eq!(
        ::core::mem::align_of::<atom_14nm_dig_transmitter_info_header_v4_0>(),
        1usize,
        concat!(
            "Alignment of ",
            stringify!(atom_14nm_dig_transmitter_info_header_v4_0)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).table_header) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_14nm_dig_transmitter_info_header_v4_0),
            "::",
            stringify!(table_header)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).pcie_phy_tmds_hdmi_macro_settings_offset) as usize
                - ptr as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_14nm_dig_transmitter_info_header_v4_0),
            "::",
            stringify!(pcie_phy_tmds_hdmi_macro_settings_offset)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).uniphy_vs_emph_lookup_table_offset) as usize - ptr as usize
        },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_14nm_dig_transmitter_info_header_v4_0),
            "::",
            stringify!(uniphy_vs_emph_lookup_table_offset)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).uniphy_xbar_settings_table_offset) as usize - ptr as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_14nm_dig_transmitter_info_header_v4_0),
            "::",
            stringify!(uniphy_xbar_settings_table_offset)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct atom_14nm_combphy_tmds_vs_set {
    pub sym_clk: u8,
    pub dig_mode: u8,
    pub phy_sel: u8,
    pub common_mar_deemph_nom__margin_deemph_val: u16,
    pub common_seldeemph60__deemph_6db_4_val: u8,
    pub cmd_bus_global_for_tx_lane0__boostadj_val: u8,
    pub common_zcalcode_ctrl__tx_driver_fifty_ohms_val: u8,
    pub margin_deemph_lane0__deemph_sel_val: u8,
}
#[test]
fn bindgen_test_layout_atom_14nm_combphy_tmds_vs_set() {
    const UNINIT: ::core::mem::MaybeUninit<atom_14nm_combphy_tmds_vs_set> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<atom_14nm_combphy_tmds_vs_set>(),
        9usize,
        concat!("Size of: ", stringify!(atom_14nm_combphy_tmds_vs_set))
    );
    assert_eq!(
        ::core::mem::align_of::<atom_14nm_combphy_tmds_vs_set>(),
        1usize,
        concat!("Alignment of ", stringify!(atom_14nm_combphy_tmds_vs_set))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).sym_clk) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_14nm_combphy_tmds_vs_set),
            "::",
            stringify!(sym_clk)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).dig_mode) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_14nm_combphy_tmds_vs_set),
            "::",
            stringify!(dig_mode)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).phy_sel) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_14nm_combphy_tmds_vs_set),
            "::",
            stringify!(phy_sel)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).common_mar_deemph_nom__margin_deemph_val) as usize
                - ptr as usize
        },
        3usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_14nm_combphy_tmds_vs_set),
            "::",
            stringify!(common_mar_deemph_nom__margin_deemph_val)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).common_seldeemph60__deemph_6db_4_val) as usize
                - ptr as usize
        },
        5usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_14nm_combphy_tmds_vs_set),
            "::",
            stringify!(common_seldeemph60__deemph_6db_4_val)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).cmd_bus_global_for_tx_lane0__boostadj_val) as usize
                - ptr as usize
        },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_14nm_combphy_tmds_vs_set),
            "::",
            stringify!(cmd_bus_global_for_tx_lane0__boostadj_val)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).common_zcalcode_ctrl__tx_driver_fifty_ohms_val) as usize
                - ptr as usize
        },
        7usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_14nm_combphy_tmds_vs_set),
            "::",
            stringify!(common_zcalcode_ctrl__tx_driver_fifty_ohms_val)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).margin_deemph_lane0__deemph_sel_val) as usize
                - ptr as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_14nm_combphy_tmds_vs_set),
            "::",
            stringify!(margin_deemph_lane0__deemph_sel_val)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct atom_DCN_dpphy_dvihdmi_tuningset {
    pub max_symclk_in10khz: u32,
    pub encoder_mode: u8,
    pub phy_sel: u8,
    pub tx_eq_main: u8,
    pub tx_eq_pre: u8,
    pub tx_eq_post: u8,
    pub reserved1: u8,
    pub tx_vboost_lvl: u8,
    pub reserved2: u8,
}
#[test]
fn bindgen_test_layout_atom_DCN_dpphy_dvihdmi_tuningset() {
    const UNINIT: ::core::mem::MaybeUninit<atom_DCN_dpphy_dvihdmi_tuningset> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<atom_DCN_dpphy_dvihdmi_tuningset>(),
        12usize,
        concat!("Size of: ", stringify!(atom_DCN_dpphy_dvihdmi_tuningset))
    );
    assert_eq!(
        ::core::mem::align_of::<atom_DCN_dpphy_dvihdmi_tuningset>(),
        1usize,
        concat!(
            "Alignment of ",
            stringify!(atom_DCN_dpphy_dvihdmi_tuningset)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).max_symclk_in10khz) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_DCN_dpphy_dvihdmi_tuningset),
            "::",
            stringify!(max_symclk_in10khz)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).encoder_mode) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_DCN_dpphy_dvihdmi_tuningset),
            "::",
            stringify!(encoder_mode)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).phy_sel) as usize - ptr as usize },
        5usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_DCN_dpphy_dvihdmi_tuningset),
            "::",
            stringify!(phy_sel)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).tx_eq_main) as usize - ptr as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_DCN_dpphy_dvihdmi_tuningset),
            "::",
            stringify!(tx_eq_main)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).tx_eq_pre) as usize - ptr as usize },
        7usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_DCN_dpphy_dvihdmi_tuningset),
            "::",
            stringify!(tx_eq_pre)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).tx_eq_post) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_DCN_dpphy_dvihdmi_tuningset),
            "::",
            stringify!(tx_eq_post)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).reserved1) as usize - ptr as usize },
        9usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_DCN_dpphy_dvihdmi_tuningset),
            "::",
            stringify!(reserved1)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).tx_vboost_lvl) as usize - ptr as usize },
        10usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_DCN_dpphy_dvihdmi_tuningset),
            "::",
            stringify!(tx_vboost_lvl)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).reserved2) as usize - ptr as usize },
        11usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_DCN_dpphy_dvihdmi_tuningset),
            "::",
            stringify!(reserved2)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct atom_DCN_dpphy_dp_setting {
    pub dp_vs_pemph_level: u8,
    pub tx_eq_main: u8,
    pub tx_eq_pre: u8,
    pub tx_eq_post: u8,
    pub tx_vboost_lvl: u8,
}
#[test]
fn bindgen_test_layout_atom_DCN_dpphy_dp_setting() {
    const UNINIT: ::core::mem::MaybeUninit<atom_DCN_dpphy_dp_setting> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<atom_DCN_dpphy_dp_setting>(),
        5usize,
        concat!("Size of: ", stringify!(atom_DCN_dpphy_dp_setting))
    );
    assert_eq!(
        ::core::mem::align_of::<atom_DCN_dpphy_dp_setting>(),
        1usize,
        concat!("Alignment of ", stringify!(atom_DCN_dpphy_dp_setting))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).dp_vs_pemph_level) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_DCN_dpphy_dp_setting),
            "::",
            stringify!(dp_vs_pemph_level)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).tx_eq_main) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_DCN_dpphy_dp_setting),
            "::",
            stringify!(tx_eq_main)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).tx_eq_pre) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_DCN_dpphy_dp_setting),
            "::",
            stringify!(tx_eq_pre)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).tx_eq_post) as usize - ptr as usize },
        3usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_DCN_dpphy_dp_setting),
            "::",
            stringify!(tx_eq_post)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).tx_vboost_lvl) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_DCN_dpphy_dp_setting),
            "::",
            stringify!(tx_vboost_lvl)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct atom_DCN_dpphy_dp_tuningset {
    pub phy_sel: u8,
    pub version: u8,
    pub table_size: u16,
    pub reserved: u16,
    pub dptunings: [atom_DCN_dpphy_dp_setting; 10usize],
}
#[test]
fn bindgen_test_layout_atom_DCN_dpphy_dp_tuningset() {
    const UNINIT: ::core::mem::MaybeUninit<atom_DCN_dpphy_dp_tuningset> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<atom_DCN_dpphy_dp_tuningset>(),
        56usize,
        concat!("Size of: ", stringify!(atom_DCN_dpphy_dp_tuningset))
    );
    assert_eq!(
        ::core::mem::align_of::<atom_DCN_dpphy_dp_tuningset>(),
        1usize,
        concat!("Alignment of ", stringify!(atom_DCN_dpphy_dp_tuningset))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).phy_sel) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_DCN_dpphy_dp_tuningset),
            "::",
            stringify!(phy_sel)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).version) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_DCN_dpphy_dp_tuningset),
            "::",
            stringify!(version)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).table_size) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_DCN_dpphy_dp_tuningset),
            "::",
            stringify!(table_size)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).reserved) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_DCN_dpphy_dp_tuningset),
            "::",
            stringify!(reserved)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).dptunings) as usize - ptr as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_DCN_dpphy_dp_tuningset),
            "::",
            stringify!(dptunings)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct atom_i2c_reg_info {
    pub ucI2cRegIndex: u8,
    pub ucI2cRegVal: u8,
}
#[test]
fn bindgen_test_layout_atom_i2c_reg_info() {
    const UNINIT: ::core::mem::MaybeUninit<atom_i2c_reg_info> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<atom_i2c_reg_info>(),
        2usize,
        concat!("Size of: ", stringify!(atom_i2c_reg_info))
    );
    assert_eq!(
        ::core::mem::align_of::<atom_i2c_reg_info>(),
        1usize,
        concat!("Alignment of ", stringify!(atom_i2c_reg_info))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ucI2cRegIndex) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_i2c_reg_info),
            "::",
            stringify!(ucI2cRegIndex)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ucI2cRegVal) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_i2c_reg_info),
            "::",
            stringify!(ucI2cRegVal)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct atom_hdmi_retimer_redriver_set {
    pub HdmiSlvAddr: u8,
    pub HdmiRegNum: u8,
    pub Hdmi6GRegNum: u8,
    pub HdmiRegSetting: [atom_i2c_reg_info; 9usize],
    pub Hdmi6GhzRegSetting: [atom_i2c_reg_info; 3usize],
}
#[test]
fn bindgen_test_layout_atom_hdmi_retimer_redriver_set() {
    const UNINIT: ::core::mem::MaybeUninit<atom_hdmi_retimer_redriver_set> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<atom_hdmi_retimer_redriver_set>(),
        27usize,
        concat!("Size of: ", stringify!(atom_hdmi_retimer_redriver_set))
    );
    assert_eq!(
        ::core::mem::align_of::<atom_hdmi_retimer_redriver_set>(),
        1usize,
        concat!("Alignment of ", stringify!(atom_hdmi_retimer_redriver_set))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).HdmiSlvAddr) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_hdmi_retimer_redriver_set),
            "::",
            stringify!(HdmiSlvAddr)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).HdmiRegNum) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_hdmi_retimer_redriver_set),
            "::",
            stringify!(HdmiRegNum)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Hdmi6GRegNum) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_hdmi_retimer_redriver_set),
            "::",
            stringify!(Hdmi6GRegNum)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).HdmiRegSetting) as usize - ptr as usize },
        3usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_hdmi_retimer_redriver_set),
            "::",
            stringify!(HdmiRegSetting)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Hdmi6GhzRegSetting) as usize - ptr as usize },
        21usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_hdmi_retimer_redriver_set),
            "::",
            stringify!(Hdmi6GhzRegSetting)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct atom_integrated_system_info_v1_11 {
    pub table_header: atom_common_table_header,
    pub vbios_misc: u32,
    pub gpucapinfo: u32,
    pub system_config: u32,
    pub cpucapinfo: u32,
    pub gpuclk_ss_percentage: u16,
    pub gpuclk_ss_type: u16,
    pub lvds_ss_percentage: u16,
    pub lvds_ss_rate_10hz: u16,
    pub hdmi_ss_percentage: u16,
    pub hdmi_ss_rate_10hz: u16,
    pub dvi_ss_percentage: u16,
    pub dvi_ss_rate_10hz: u16,
    pub dpphy_override: u16,
    pub lvds_misc: u16,
    pub backlight_pwm_hz: u16,
    pub memorytype: u8,
    pub umachannelnumber: u8,
    pub pwr_on_digon_to_de: u8,
    pub pwr_on_de_to_vary_bl: u8,
    pub pwr_down_vary_bloff_to_de: u8,
    pub pwr_down_de_to_digoff: u8,
    pub pwr_off_delay: u8,
    pub pwr_on_vary_bl_to_blon: u8,
    pub pwr_down_bloff_to_vary_bloff: u8,
    pub min_allowed_bl_level: u8,
    pub htc_hyst_limit: u8,
    pub htc_tmp_limit: u8,
    pub reserved1: u8,
    pub reserved2: u8,
    pub extdispconninfo: atom_external_display_connection_info,
    pub dvi_tuningset: atom_14nm_dpphy_dvihdmi_tuningset,
    pub hdmi_tuningset: atom_14nm_dpphy_dvihdmi_tuningset,
    pub hdmi6g_tuningset: atom_14nm_dpphy_dvihdmi_tuningset,
    pub dp_tuningset: atom_14nm_dpphy_dp_tuningset,
    pub dp_hbr3_tuningset: atom_14nm_dpphy_dp_tuningset,
    pub camera_info: atom_camera_data,
    pub dp0_retimer_set: atom_hdmi_retimer_redriver_set,
    pub dp1_retimer_set: atom_hdmi_retimer_redriver_set,
    pub dp2_retimer_set: atom_hdmi_retimer_redriver_set,
    pub dp3_retimer_set: atom_hdmi_retimer_redriver_set,
    pub dp_hbr_tuningset: atom_14nm_dpphy_dp_tuningset,
    pub dp_hbr2_tuningset: atom_14nm_dpphy_dp_tuningset,
    pub edp_tuningset: atom_14nm_dpphy_dp_tuningset,
    pub reserved: [u32; 66usize],
}
#[test]
fn bindgen_test_layout_atom_integrated_system_info_v1_11() {
    const UNINIT: ::core::mem::MaybeUninit<atom_integrated_system_info_v1_11> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<atom_integrated_system_info_v1_11>(),
        1024usize,
        concat!("Size of: ", stringify!(atom_integrated_system_info_v1_11))
    );
    assert_eq!(
        ::core::mem::align_of::<atom_integrated_system_info_v1_11>(),
        1usize,
        concat!(
            "Alignment of ",
            stringify!(atom_integrated_system_info_v1_11)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).table_header) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_integrated_system_info_v1_11),
            "::",
            stringify!(table_header)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).vbios_misc) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_integrated_system_info_v1_11),
            "::",
            stringify!(vbios_misc)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).gpucapinfo) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_integrated_system_info_v1_11),
            "::",
            stringify!(gpucapinfo)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).system_config) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_integrated_system_info_v1_11),
            "::",
            stringify!(system_config)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).cpucapinfo) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_integrated_system_info_v1_11),
            "::",
            stringify!(cpucapinfo)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).gpuclk_ss_percentage) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_integrated_system_info_v1_11),
            "::",
            stringify!(gpuclk_ss_percentage)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).gpuclk_ss_type) as usize - ptr as usize },
        22usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_integrated_system_info_v1_11),
            "::",
            stringify!(gpuclk_ss_type)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).lvds_ss_percentage) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_integrated_system_info_v1_11),
            "::",
            stringify!(lvds_ss_percentage)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).lvds_ss_rate_10hz) as usize - ptr as usize },
        26usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_integrated_system_info_v1_11),
            "::",
            stringify!(lvds_ss_rate_10hz)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).hdmi_ss_percentage) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_integrated_system_info_v1_11),
            "::",
            stringify!(hdmi_ss_percentage)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).hdmi_ss_rate_10hz) as usize - ptr as usize },
        30usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_integrated_system_info_v1_11),
            "::",
            stringify!(hdmi_ss_rate_10hz)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).dvi_ss_percentage) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_integrated_system_info_v1_11),
            "::",
            stringify!(dvi_ss_percentage)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).dvi_ss_rate_10hz) as usize - ptr as usize },
        34usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_integrated_system_info_v1_11),
            "::",
            stringify!(dvi_ss_rate_10hz)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).dpphy_override) as usize - ptr as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_integrated_system_info_v1_11),
            "::",
            stringify!(dpphy_override)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).lvds_misc) as usize - ptr as usize },
        38usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_integrated_system_info_v1_11),
            "::",
            stringify!(lvds_misc)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).backlight_pwm_hz) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_integrated_system_info_v1_11),
            "::",
            stringify!(backlight_pwm_hz)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).memorytype) as usize - ptr as usize },
        42usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_integrated_system_info_v1_11),
            "::",
            stringify!(memorytype)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).umachannelnumber) as usize - ptr as usize },
        43usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_integrated_system_info_v1_11),
            "::",
            stringify!(umachannelnumber)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).pwr_on_digon_to_de) as usize - ptr as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_integrated_system_info_v1_11),
            "::",
            stringify!(pwr_on_digon_to_de)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).pwr_on_de_to_vary_bl) as usize - ptr as usize },
        45usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_integrated_system_info_v1_11),
            "::",
            stringify!(pwr_on_de_to_vary_bl)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).pwr_down_vary_bloff_to_de) as usize - ptr as usize },
        46usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_integrated_system_info_v1_11),
            "::",
            stringify!(pwr_down_vary_bloff_to_de)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).pwr_down_de_to_digoff) as usize - ptr as usize },
        47usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_integrated_system_info_v1_11),
            "::",
            stringify!(pwr_down_de_to_digoff)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).pwr_off_delay) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_integrated_system_info_v1_11),
            "::",
            stringify!(pwr_off_delay)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).pwr_on_vary_bl_to_blon) as usize - ptr as usize },
        49usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_integrated_system_info_v1_11),
            "::",
            stringify!(pwr_on_vary_bl_to_blon)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).pwr_down_bloff_to_vary_bloff) as usize - ptr as usize
        },
        50usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_integrated_system_info_v1_11),
            "::",
            stringify!(pwr_down_bloff_to_vary_bloff)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).min_allowed_bl_level) as usize - ptr as usize },
        51usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_integrated_system_info_v1_11),
            "::",
            stringify!(min_allowed_bl_level)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).htc_hyst_limit) as usize - ptr as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_integrated_system_info_v1_11),
            "::",
            stringify!(htc_hyst_limit)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).htc_tmp_limit) as usize - ptr as usize },
        53usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_integrated_system_info_v1_11),
            "::",
            stringify!(htc_tmp_limit)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).reserved1) as usize - ptr as usize },
        54usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_integrated_system_info_v1_11),
            "::",
            stringify!(reserved1)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).reserved2) as usize - ptr as usize },
        55usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_integrated_system_info_v1_11),
            "::",
            stringify!(reserved2)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).extdispconninfo) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_integrated_system_info_v1_11),
            "::",
            stringify!(extdispconninfo)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).dvi_tuningset) as usize - ptr as usize },
        196usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_integrated_system_info_v1_11),
            "::",
            stringify!(dvi_tuningset)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).hdmi_tuningset) as usize - ptr as usize },
        208usize,
        concat!(
            "Offset of field: ",
            stringify!(atom_integrated_system_info_v1_11),
            "::",
            stringify!(hdmi_tuningset)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).hdmi6g_tuningset) as usize - ptr as usize },
        220usize,
